[
  {
    "id": "3",
    "name": "African University College of Communication",
    "location": "Adabraka",
    "country": "Ghana",
    "region": "Greater Accra",
    "town": "Accra",
    "type": "private",
    "note": "The African University College of Communications (AUCC) is a private institution offering programs in Communication Studies, Business Administration, and Technology. Renowned as a UNESCO Centre of Excellence, AUCC is affiliated with GIMPA and globally connected through exchange programs. It also hosts specialized centers like the Kwabena Nketia Centre for Africana Studies and plans to expand its offerings and campuses.",
    "nick": "AUCC",
    "campus_number": "1",
    "campuses": [
      "African University College of Communications has a single campus in Adabraka, Accra, where all programs are offered on-campus."
    ],
    "image": "https://www.dropbox.com/scl/fi/p74b8jtwbwoq6xpma88mv/Screenshot_20241003_203736_Google.jpg?rlkey=szgb51rama0tqwogsp08mfylo&st=39e7rcwz&raw=1",
    "logo": "https://www.dropbox.com/scl/fi/xz7rtympgfprl218kcl3h/Screenshot_20241003_204316_Google.jpg?rlkey=02tvl1xra611vtknh3rxbto5c&st=rphbk79m&raw=1",
    "est_year": "2002",
    "rank": "377th",
    "application": "https://portal.aucc.edu.gh/applicant",
    "rate": "4.3",
    "reviews": "67 Google",
    "placement": "4.2",
    "hostel": "3.9",
    "facilities": "3.7",
    "sports": "3.9",
    "amenities": "3.5",
    "strength": [
      "Reputation for Excellence: Recognized by UNESCO as a Centre of Excellence and offers flagship programs in Journalism and Communication Studies.",
      "Broad Academic Offerings: Provides diverse programs in Communications, Business Administration, and Technology with plans for expansion.",
      "Global Affiliations: Strong international partnerships and exchange programs enhance global exposure for students.",
      "Specialized Centers: Unique facilities like the Kwabena Nketia Centre for Africana Studies and the AUCC Pensions Academy enrich learning opportunities.",
      "Experienced Leadership: Founded by Hon. Kojo Yankah, with extensive expertise in journalism and public service."
    ],
    "weakness": [
      "Limited Geographic Reach: Current physical presence is limited, with only future plans to establish additional campuses like Tamale.",
      "Dependency on Approvals: Expansion into new programs and campuses depends heavily on accreditation and regulatory approvals.",
      "Niche Focus: Strong emphasis on communication and journalism may limit appeal to students seeking other disciplines.",
      "Relatively Young: Still building its reputation and alumni network compared to older institutions."
    ],
    "g_video": "https://web.facebook.com/auccafrica/videos/african-university-college-of-communications-aucc/387912971857207/?_rdc=1&_rdr"
  }
]
