[
  {
    "id": "16",
    "name": "Radford University College",
    "location": "East Legon",
    "country": "Ghana",
    "region": "Greater Accra",
    "town": "Accra",
    "type": "private",
    "note": "Radford University College (RUC), affiliated with Kwame Nkrumah University of Science and Technology (KNUST), offers a diverse range of degree programs including Graphic Design, Fashion Design, Medical Laboratory Technology, and Business Administration. Renowned for its academic excellence, RUC features modern facilities, innovative teaching methods, and a qualified faculty. It is celebrated for pioneering Ghana’s first Bachelor’s degree program in Fashion Design, earning national and international recognition.",
    "nick": "MUC",
    "est_year": "2009",
    "rank": "398th",
    "application": "https://ruc.edu.gh/how-to-apply",
    "rate": "4.1",
    "reviews": "143 Google",
    "placement": "4.2",
    "hostel": "3.9",
    "facilities": "3.7",
    "sports": "3.9",
    "amenities": "3.6",
    "campus_number": "1",
    "campuses": [
      "Radford University College has a single campus in East Legony, Accra, where all programmes are takne on-campus."
    ],
    "image": "https://www.dropbox.com/scl/fi/dtlepy9yu8056shmt7zu1/Radford-University-College-Accra-Ghana-SchoolFinder-TortoisePathcom-1.jpeg?rlkey=4bn1o977sybb0jkw9s6pk3hm7&st=thmowl9q&raw=1",
    "logo": "https://www.dropbox.com/scl/fi/dbsglbsmlgvem1h801tp8/download-2.jpeg?rlkey=y1lx9cegahx8yn3zi9hgd76r4&st=kk81ljvs&raw=1",
    "strength": [
      "Strong Affiliation: Partnership with KNUST enhances credibility and academic standards.",
      "Program Diversity: Offers a wide range of industry-relevant degree programs.",
      "Innovative Leadership: Pioneer of Ghana’s first Bachelor’s program in Fashion Design.",
      "Modern Facilities: Equipped with advanced labs, studios, and libraries to support learning.",
      "Strategic Location: Situated in Accra, providing accessibility and exposure to opportunities.",
      "Academic Reputation: Recognized for excellence, with graduates excelling globally."
    ],
    "weakness": [
      "Limited Reach: Focused primarily on urban students due to its Accra location.",
      "Resource Dependence: Reliance on KNUST for accreditation and academic oversight.",
      "Specialized Recognition: Strong in Fashion Design but less visibility in other programs.",
      "Competition: Faces challenges from larger universities offering similar programs.",
      "Scalability: Potential constraints in expanding infrastructure and resources for increasing demand."
    ],
    "g_video": "https://web.facebook.com/RadfordUC/videos/3038436229768100/"
  }
]
