[
  {
    "id": "24",
    "name": "West End University College",
    "location": "Ngleshie Amanfro",
    "country": "Ghana",
    "region": "Greater Accra",
    "town": "Accra",
    "type": "private",
    "note": "West End University College (WEUC), established in 2010 and situated in Ngleshie-Amanfro, Accra, is an independent, non-denominational tertiary institution accredited by the National Accreditation Board and affiliated with the University of Cape Coast. WEUC offers comprehensive programs and services aimed at addressing societal educational and technical needs through learning, research, and outreach, fostering leadership, innovation, and social stewardship.",
    "nick": "WEUC",
    "est_year": "2010",
    "rank": "910th",
    "application": "https://weuc.edu.gh/admissions",
    "rate": "4.4",
    "reviews": "74 Google",
    "placement": "4.2",
    "hostel": "3.9",
    "facilities": "3.7",
    "sports": "3.9",
    "amenities": "3.6",
    "campus_number": "1",
    "campuses": [
      "West End University College has only campus in Ngleshie Amanfro, which  is accredited by the National Accreditation Board (NAB) of the Ministry of Education. WEUC is also affiliated with the University of Cape Coast (UCC). This is where all their academic activities are held"
    ],
    "image": "https://www.dropbox.com/scl/fi/nj8r4dbgk5eto3r9jc63f/img_2_1736110691956.jpg?rlkey=3wrjofl20abd80kx8jyqxi5ge&st=fbqtxgod&raw=1",
    "logo": "https://www.dropbox.com/scl/fi/hsbhbo7ba59522c31xiz2/1000090479-removebg-preview.png?rlkey=14cns4yde6nd951qx35yk9dyp&st=oy0l26g6&raw=1",
    "strength": [
      "Accreditation and Affiliation: Accredited by the National Accreditation Board and affiliated with the University of Cape Coast, ensuring academic credibility and recognition.",
      "Comprehensive Programs: Offers a wide range of programs that address societal and technical needs, fostering innovation and leadership.",
      "Urban Location: Situated in Ngleshie-Amanfro, Accra, with proximity to major city amenities, providing accessibility to students.",
      "Mission-Driven Focus: Strong emphasis on leadership, organizational change, and social stewardship, aligning education with societal development.",
      "Modern Facilities: Urban setting conducive to learning and research activities."
    ],
    "weakness": [
      "Relatively New Institution: Established in 2010, WEUC may face challenges competing with older, more established universities in terms of reputation and alumni network.",
      "Limited International Recognition: As a local institution, it may lack the global presence or partnerships necessary for international competitiveness.",
      "Narrow Urban Focus: Located in the urban periphery, the institution may have limited appeal to students from rural or remote areas.",
      "Potential Resource Constraints: As a private institution, maintaining state-of-the-art facilities and extensive research funding could be challenging without robust financial support."
    ],
    "g_video": "https://www.youtube.com/watch?v=aj47b2qlZbA"
  }
]
