[
  {
    "id": "1",
    "name": "Academic City University College",
    "location": "Haatso",
    "type": "affiliated",
    "note": "Academic City University College is a premier institution offering a diverse range of undergraduate programs with a strong emphasis on engineering, business, and technology. Committed to delivering a hands-on, practical education, ACC equips students with the essential skills to excel in the modern workforce. With a focus on innovation and critical thinking, ACC fosters an environment where students are prepared to become future leaders across various industries.",
    "nick": "Acity",
    "campus_number": "1",
    "campuses": [
      "Academic City University College has a single campus in  Agbogba, Haatso, where all undergraduate programs are offered on-site.",
      "While there are no distance learning options for undergraduates, select master's programs are available online. The campus provides a dynamic environment for innovation and learning."
    ],
    "image": "https://www.dropbox.com/scl/fi/xcdodh0ecpkkh1bnurgdh/Acity.jpg?rlkey=6omrqvlr0wwxq095eif5nzdfp&st=kvnefofu&raw=1",
    "logo": "https://www.dropbox.com/scl/fi/1h6zn6qxyr003soh1xmnu/acity_logo.png?rlkey=mjmfk6scxf9da54oplj6cl2m7&st=zw4qg3v8&raw=1",
    "country": "Ghana",
    "region": "Greater Accra",
    "town": "Accra",
    "est_year": "2009",
    "rank": "15th",
    "application": "https://acity.edu.gh/admissions.php",
    "rate": "4.4",
    "reviews": "239 Google",
    "placement": "4.0",
    "hostel": "4.6",
    "facilities": "4.0",
    "sports": "3.9",
    "amenities": "3.9",
    "strength": [
      "Innovative Programs: The university offers cutting-edge programs in fields like Robotics Engineering and Data Science, providing students with practical, industry-relevant skills",
      "International Exposure: Academic City University College provides students with opportunities to study abroad and engage with global universities, enhancing their international perspectives and career prospects.",
      "Strong Industry Connections: Through robust industry partnerships and real-world experience opportunities, students gain valuable exposure and practical insights into their fields"
    ],
    "weakness": [
      "Limited Course Variety: While the university offers strong programs in specific fields, the range of courses available in other areas might be limited.",
      "Poor Road Infrastructure: The university’s location is hindered by inadequate road infrastructure, which can affect accessibility and commuting for students.",
      "High Tuition Fees: The cost of tuition may be relatively high, which could be a barrier for some prospective students and limit accessibility."
    ],
    "g_video": "https://youtu.be/pBPjJbiRBrw?si=yPtyKlCZKa57crfU"
  },
  {
    "id": "2",
    "name": "Accra Business School",
    "location": "Spintex",
    "type": "affiliated",
    "note": "Accra Business School is a leading institution offering a range of business-related programs designed to equip students with practical skills and knowledge for the modern business world. With a focus on leadership, innovation, and entrepreneurship, the school provides a dynamic learning environment that fosters professional growth and academic excellence.",
    "nick": "ABS",
    "campus_number": "1",
    "campuses": [
      "Accra Business School has a single campus in   Basket junction near Pleasant Place Church, Spintex Road, Spintex, Accra where all programs are offered on-site. ",
      "Beside their in person lectures, there is also a couple of programs that cam b take fully online"
    ],
    "image": "https://www.dropbox.com/scl/fi/mccogznnum9ekxnjqymmn/Accra-Business-School-6.jpg?rlkey=ksnrrak6b8m9amewvcqcxsbc2&st=353t40zq&raw=1",
    "logo": "https://www.dropbox.com/scl/fi/9piu33czhq015fiu2m9yg/Logos-03.png?rlkey=f8uhnamcqzvwl85z6acr5cy81&st=20p92t4h&raw=1",
    "country": "Ghana",
    "region": "Greater Accra",
    "town": "Accra",
    "est_year": "2004",
    "rank": "Unknown",
    "application": "https://abs.edu.gh/apply-now",
    "rate": "4.4",
    "reviews": "164 Google",
    "placement": "4.0",
    "hostel": "4.6",
    "facilities": "4.0",
    "sports": "3.9",
    "amenities": "3.9",
    "strength": [
      "With partnerships across continents, Accra Business School gives students access to international programs, exchanges, and diverse business perspectives.",
      "Grounded in Christian values, the school instills a strong sense of ethical leadership and integrity, which are crucial for long-term success in the business world.",
      "The school’s primary emphasis on executive leadership and management programs sets it apart, offering professionals tailored courses to enhance their strategic skills."
    ],
    "weakness": [
      "Although the school has a growing reputation, it is still working to establish broader recognition beyond West Africa in comparison to more globally renowned business schools.",
      "Accra Business School’s specialized programs can come with a high tuition fee, making it less accessible for some students compared to other institutions.",
      "High Tuition Fees: The cost of tuition may be relatively high, which could be a barrier for some prospective students and limit accessibility."
    ],
    "g_video": "https://facebook.com/angutech/videos/welcome-to-angutech/283889712886997/?_rdc=1&_rdr"
  },
  {
    "id": "3",
    "name": "African University College of Communication",
    "location": "Adabraka",
    "country": "Ghana",
    "region": "Greater Accra",
    "town": "Accra",
    "type": "private",
    "note": "The African University College of Communications (AUCC) is a private institution offering programs in Communication Studies, Business Administration, and Technology. Renowned as a UNESCO Centre of Excellence, AUCC is affiliated with GIMPA and globally connected through exchange programs. It also hosts specialized centers like the Kwabena Nketia Centre for Africana Studies and plans to expand its offerings and campuses.",
    "nick": "AUCC",
    "campus_number": "1",
    "campuses": [
      "African University College of Communications has a single campus in Adabraka, Accra, where all programs are offered on-campus."
    ],
    "image": "https://www.dropbox.com/scl/fi/p74b8jtwbwoq6xpma88mv/Screenshot_20241003_203736_Google.jpg?rlkey=szgb51rama0tqwogsp08mfylo&st=39e7rcwz&raw=1",
    "logo": "https://www.dropbox.com/scl/fi/xz7rtympgfprl218kcl3h/Screenshot_20241003_204316_Google.jpg?rlkey=02tvl1xra611vtknh3rxbto5c&st=rphbk79m&raw=1",
    "est_year": "2002",
    "rank": "377th",
    "application": "https://portal.aucc.edu.gh/applicant",
    "rate": "4.3",
    "reviews": "67 Google",
    "placement": "4.2",
    "hostel": "3.9",
    "facilities": "3.7",
    "sports": "3.9",
    "amenities": "3.5",
    "strength": [
      "Reputation for Excellence: Recognized by UNESCO as a Centre of Excellence and offers flagship programs in Journalism and Communication Studies.",
      "Broad Academic Offerings: Provides diverse programs in Communications, Business Administration, and Technology with plans for expansion.",
      "Global Affiliations: Strong international partnerships and exchange programs enhance global exposure for students.",
      "Specialized Centers: Unique facilities like the Kwabena Nketia Centre for Africana Studies and the AUCC Pensions Academy enrich learning opportunities.",
      "Experienced Leadership: Founded by Hon. Kojo Yankah, with extensive expertise in journalism and public service."
    ],
    "weakness": [
      "Limited Geographic Reach: Current physical presence is limited, with only future plans to establish additional campuses like Tamale.",
      "Dependency on Approvals: Expansion into new programs and campuses depends heavily on accreditation and regulatory approvals.",
      "Niche Focus: Strong emphasis on communication and journalism may limit appeal to students seeking other disciplines.",
      "Relatively Young: Still building its reputation and alumni network compared to older institutions."
    ],
    "g_video": "https://web.facebook.com/auccafrica/videos/african-university-college-of-communications-aucc/387912971857207/?_rdc=1&_rdr"
  },
  {
    "id": "4",
    "name": "Anglican University College of Technology",
    "town": "Kumasi",
    "type": "affiliated",
    "note": "Anglican University College of Technology is a private institution that combines faith and learning to offer quality education in technology and management. Focused on practical training and community service, AUCT provides various undergraduate programs to prepare students for successful careers in a dynamic job market.",
    "nick": "ANG.U.TECH",
    "campus_number": "2",
    "campuses": [
      "Accra Business School has a two campuses One in Ash Town and Nkoranza - Bono East Region, where all programs are offered on-site. ",
      "Beside their in person lectures, there is also a couple of programs that cam b take fully online"
    ],
    "image": "https://www.dropbox.com/scl/fi/b4zgk4np6pk0gpjxlyh18/2018-05-23.jpg?rlkey=h6com0bt1ugbxul785scfrnca&st=ar02nacn&raw=1",
    "logo": "https://www.dropbox.com/scl/fi/9kauq8lgzl49sfs8e9ifw/1000102082-removebg-preview.png?rlkey=zholivsea6ittjnv0m17deb7f&st=y5mzcjo8&raw=1",
    "country": "Ghana",
    "region": "Ashanti Region",
    "location": "Ash Town",
    "est_year": "2008",
    "rank": "788",
    "application": "https://www.angutech.edu.gh/apply",
    "rate": "4.4",
    "reviews": "164 Google",
    "placement": "4.0",
    "hostel": "4.6",
    "facilities": "4.0",
    "sports": "3.9",
    "amenities": "3.9",
    "strength": [
      "With partnerships across continents, Accra Business School gives students access to international programs, exchanges, and diverse business perspectives.",
      "Grounded in Christian values, the school instills a strong sense of ethical leadership and integrity, which are crucial for long-term success in the business world.",
      "The school’s primary emphasis on executive leadership and management programs sets it apart, offering professionals tailored courses to enhance their strategic skills."
    ],
    "weakness": [
      "Although the school has a growing reputation, it is still working to establish broader recognition beyond West Africa in comparison to more globally renowned business schools.",
      "Accra Business School’s specialized programs can come with a high tuition fee, making it less accessible for some students compared to other institutions.",
      "High Tuition Fees: The cost of tuition may be relatively high, which could be a barrier for some prospective students and limit accessibility."
    ],
    "g_video": "https://www.youtube.com/@accrabusinessschool18"
  },
  {
    "id": "5",
    "name": "Catholic Institute of Business and Technology",
    "location": "Accra",
    "town": "Accra",
    "region": "Greater Accra",
    "reviews": "70 Google",
    "rate": "4.2",
    "est_year": "2007",
    "rank": "881th",
    "application": "https://cibt.edu.gh/about-admissions/how-to-apply/",
    "campus_number": "1",
    "campuses": [
      "CIBT’s campus is conveniently located in the heart of Accra, providing easy access to the city’s resources and amenities. Its central location makes it ideal for students seeking a vibrant urban experience while pursuing their studies.",
      "Despite its compact size, the campus fosters a close-knit community, where students enjoy a friendly and supportive environment. This intimate setting encourages interaction between students and faculty, creating a welcoming atmosphere that enhances academic and social life."
    ],
    "note": "The Catholic Institute of Business and Technology (CIBT), founded in 2007 under the Catholic Archdiocese of Accra, is accredited and affiliated with the University of Ghana. Located in central Accra, CIBT offers a welcoming campus and degree programs in Business, Public Administration, Computer Science, and Religion. It maintains a Catholic identity while embracing all faiths, with new programs like Procurement and Supply Chain Management soon to launch.",
    "Page": "AsheisiPage",
    "nick": "CIBT",
    "type": "affiliated",
    "image": "https://www.dropbox.com/scl/fi/c2wawv1p3wbqj4nugeus6/Screenshot_20240924_170119_Maps.jpg?rlkey=dufjsdjy3zlh65j3ghb6wff4r&st=p47fmxtm&raw=1",
    "logo": "https://www.dropbox.com/scl/fi/gyhzyabqmmfvb2m6yge87/1000102553-removebg-preview.png?rlkey=g25hyjcybrfduseen9d9u4ly4&st=sazrxkeo&raw=1",
    "strength": [
      "CIBT’s compact campus in central Accra creates a close-knit community where students and faculty build strong connections, ensuring a supportive and engaging environment.",
      "As a Catholic institution, CIBT fosters a Christian atmosphere while welcoming students from all faiths, promoting inclusivity and personal growth.",
      "CIBT offers a wide range of academic programs, including new courses like Procurement and Supply Chain Management, preparing students for leadership in professional and civic life."
    ],
    "weakness": [
      "CIBT’s small size may limit the range of facilities and extracurricular activities available to students compared to larger universities.",
      "Being located in the heart of Accra, the campus may face challenges with space constraints, affecting future expansion and student accommodation.",
      "As a relatively young institution, CIBT is still building its reputation, which may impact its visibility and competitiveness among more established universities."
    ],
    "g_video": "https://facebook.com/CIBTghana/videos/cibt-your-trusted-university/7137996592984305/?_rdc=1&_rdr"
  },
  {
    "id": "6",
    "name": "Christian Service University College ",
    "town": "Kumasi",
    "location": "Odeneho Kwadaso",
    "region": "Ashanti Region",
    "reviews": "248 Google",
    "rate": "4.3",
    "campus_number": "1",
    "campuses": [
      "Christian Service University College (CSUC) is situated in a peaceful area of Kumasi, offering a conducive learning environment. The campus features modern facilities, including lecture halls, a library, and computer labs.",
      " With a strong Christian ethos, CSUC promotes both spiritual and academic growth, while a vibrant campus life encourages student engagement in religious, social, and extracurricular activities."
    ],
    "note": "require('../../assets/knust.jpeg')",
    "Page": "AshesiPage",
    "nick": "CSUC",
    "rank": "347th",
    "type": "affiliated",
    "est_year": "1974",
    "application": "https://admission.csuc.edu.gh/admissions/Account/LogOn?ReturnUrl=%2fadmissions",
    "image": "https://www.dropbox.com/scl/fi/xjjl9i7h7bch29e0o9vlr/Screenshot_20240924_214404_Maps.jpg?rlkey=nv2p83z0su39yej8z4x2e1odh&st=ia37q8su&raw=1",
    "logo": "https://www.dropbox.com/scl/fi/65x4ubgod7t91r6ctzulh/1000102634-removebg-preview.png?rlkey=ug0zy0md913pgz2dgwtm3bf3b&st=y1ivmfmy&raw=1",
    "g_video": "https://youtu.be/XPxNp7Q_H_o?si=UH8OOKITQIPkN_y1",
    "strength": []
  },
  {
    "id": "7",
    "name": "Dominion University College",
    "location": "East Legon",
    "country": "Ghana",
    "region": "Greater Accra",
    "town": "Accra",
    "type": "private",
    "note": "Dominion University College, established in 2009 and accredited in 2012, aims to empower students through quality education, character development, research, and community engagement. Committed to academic excellence, it offers a vibrant campus life, modern facilities, and innovative teaching to nurture future leaders.",
    "nick": "DUC",
    "est_year": "2009",
    "rank": "774th",
    "application": "https://admissions.duc.edu.gh/accounts/register",
    "rate": "4.6",
    "reviews": "121 Google",
    "placement": "4.3",
    "hostel": "3.9",
    "facilities": "3.7",
    "sports": "3.9",
    "amenities": "3.5",
    "campus_number": "1",
    "campuses": [
      " The Dominion University College has only one campus in East Legon, Accra, where all programs are offered on-campus."
    ],
    "image": "https://www.dropbox.com/scl/fi/15s81dovpg9ctvppkwe65/2018-09-04.jpg?rlkey=3adzx6c5seo2rgsx254iyh6l2&st=u1oqv5m0&raw=1",
    "logo": "https://www.dropbox.com/scl/fi/vt8nqvjox3nv3xuphtj55/images-3.jpeg?rlkey=v6tmeod47qd8lwc26oqwxixxm&st=wgogbysg&raw=1",
    "strength": [
      "Quality Education: Focus on academic excellence and character development.",
      "Modern Facilities: State-of-the-art infrastructure supports learning and research.",
      "Innovative Curricula: Offers programs designed to meet contemporary educational and societal needs.",
      "Community Engagement: Actively involves students in societal impact initiatives.",
      "Vibrant Campus Life: Provides a conducive and dynamic environment for holistic student development."
    ],
    "weakness": [
      "Limited History: Being a relatively new institution, it has a smaller alumni network and less established reputation.",
      "Regional Recognition: May face challenges in gaining visibility and competitiveness on a global scale.",
      "Resource Dependency: Potential constraints in maintaining cutting-edge facilities and programs over time.",
      "Focused Offerings: May lack the diversity in programs compared to more comprehensive universities."
    ],
    "g_video": "https://www.instagram.com/duc_ghana/reel/C8844iMN-pv"
  },
  {
    "id": "8",
    "name": "Evangelical Presbyterian University College",
    "location": "Ho",
    "country": "Ghana",
    "region": "Volta Region",
    "town": "Ho",
    "type": "private",
    "note": "The E.P. Church, with a 160-year history in Ghana, resolved at its 1999 Synod to establish a university in the Volta Region in response to regional demands. Known for providing social services like schools, health facilities, and agricultural initiatives, the church seeks to fulfill its mission of 'Bringing light to where there is darkness.'",
    "nick": "EPUC",
    "est_year": "1999",
    "rank": "454th",
    "application": "https://www.epuc.edu.gh/university/index.php/admissions/how-to-apply",
    "rate": "4.1",
    "reviews": "59 Google",
    "placement": "4.2",
    "hostel": "3.9",
    "facilities": "3.7",
    "sports": "3.9",
    "amenities": "3.5",
    "campus_number": "2",
    "campuses": [
      " The Evangelical Presbyterian University College has two campuses. The main campus in Ho and the other in Peki both in the Volta Region, where all programs are offered on-campus."
    ],
    "image": "https://www.dropbox.com/scl/fi/9pxsf7nptolwuu5qc5rju/peki_campus.jpg?rlkey=c1po2dkw0g0busd9mi964r9l1&st=82vagve4&raw=1",
    "logo": "https://www.dropbox.com/scl/fi/tqflxjj37xdsjijc9psf6/images-2.jpeg?rlkey=6phxau4ibtkrl3x18ab46bqsn&st=3b1tk9nk&raw=1",
    "strength": [
      "Strong Community Focus: Long-standing commitment to social services, including education, healthcare, and agriculture, demonstrates dedication to community welfare.",
      "Mission-Driven Vision: The church’s guiding mission, 'Bringing light to where there is darkness,' provides a clear and inspirational foundation for initiatives.",
      "Historical Credibility: Over 160 years of active presence in Ghana lends credibility and trust to its projects, including the establishment of a university.",
      "Regional Advocacy: Addressing the educational needs of the Volta Region aligns with a significant public demand, ensuring local relevance."
    ],
    "weakness": [
      "Resource Dependence: Establishing a university requires substantial financial and infrastructural investment, which may strain church resources.",
      "Late Entry: Entering the university sector later than other institutions could pose challenges in competing for students and staff.",
      "Limited Expertise in Tertiary Education: While experienced in basic and secondary education, the transition to higher education may require significant adjustments and capacity building."
    ],
    "g_video": "https://web.facebook.com/epuniversitycollege/videos/epuc-students-visit-national-development-planning-commissionlevel-400-students-f/4233589713344995/?_rdc=1&_rdr"
  },
  {
    "id": "9",
    "name": "Family Health University College",
    "location": "Teshie",
    "country": "Ghana",
    "region": "Greater Accra",
    "town": "Accra",
    "type": "private",
    "note": "Family Health University College began in 1997 as a diagnostic center and evolved into a hospital, later establishing a Nursing and Midwifery School in 2009. In 2015, it became Ghana’s first private medical school and gained university college status in 2016, now located at Teshie near the Atlantic Ocean.",
    "nick": "FHU",
    "est_year": "1997",
    "rank": "Unknown",
    "application": "https://iapply.fhu.edu.gh/Account/LogIn?ReturnUrl=%2F",
    "rate": "4.5",
    "reviews": "10 Google",
    "placement": "4.7",
    "hostel": "3.9",
    "facilities": "3.7",
    "sports": "3.9",
    "amenities": "3.5",
    "campus_number": "1",
    "campuses": [
      " The Family Health University College has only one campus in Teshie Road, Accra, where all programs are offered on-campus."
    ],
    "image": "https://www.dropbox.com/scl/fi/ux4d571hiwkpgdzzr5x03/new001-1024x640.jpg?rlkey=pee8wankipkyw5y41bqo3qjh1&st=zeq16xuu&raw=1",
    "logo": "https://www.dropbox.com/scl/fi/ky86jeyom9dp0ewcu1l9q/download-1.jpeg?rlkey=xjzsqkzxe3pcgzh7ubm6le8zl&st=ovtq4436&raw=1",
    "strength": [
      "Pioneering Role: Ghana’s first private medical school, demonstrating innovation and leadership in healthcare education.",
      "Comprehensive Growth: Transitioned from a diagnostic center to a university college with a focus on health sciences.",
      "Strategic Location: Positioned at Teshie, offering accessibility and a serene learning environment near the Atlantic Ocean.",
      "Specialized Focus: Strong emphasis on training healthcare professionals, addressing critical needs in the sector.",
      "Institutional Heritage: Built on the foundation of a successful hospital, providing practical exposure for students.brant Campus Life: Provides a conducive and dynamic environment for holistic student development."
    ],
    "weakness": [
      "Limited Academic Scope: Focus on health sciences may restrict diversity in academic offerings.",
      "Relatively New University College: Shorter history compared to older institutions might limit its prestige and alumni influence.",
      "Resource Dependency: Requires sustained investment to maintain and expand facilities and programs.",
      "Geographic Focus: Primarily caters to healthcare, which may limit appeal to students seeking broader disciplines."
    ],
    "g_video": "https://www.youtube.com/watch?v=MtxU8Hx0RRo"
  },
  {
    "id": "10",
    "name": "Ghana Christian University College",
    "location": "Amranhia",
    "country": "Ghana",
    "region": "Greater Accra",
    "town": "Accra",
    "type": "private",
    "note": "Ghana Christian University College', formerly known as Ghana Christian College and Seminary, is a private tertiary institution in Ghana. It was established in 1966 by independent Christian missionaries from the United States.",
    "nick": "Ghanacu",
    "est_year": "1966",
    "rank": "804th",
    "application": "https://ghanacu.edu.gh/Admission%20Registration%20Form/index.html",
    "rate": "4.2",
    "reviews": "133 Google",
    "placement": "4.5",
    "hostel": "3.9",
    "facilities": "3.7",
    "sports": "3.9",
    "amenities": "3.6",
    "campus_number": "3",
    "campuses": [
      "Ghana Christian University College has three campuses. The main campus in Amranhia, Dodowa road, Accra, The two other majoring as in learning centers. Takoradi learning center: Located at Bompeh Secondary Technical in Takoradi and Kumasi learning center: Located in the Suame Post Office area in Kumasi"
    ],
    "image": "https://www.dropbox.com/scl/fi/gve8j6lmg7zry6jsdrcsp/1524815453-96-ghana-christian-university-college.jpg?rlkey=oh6nsugpi5oh9d1ht84wqpw2h&st=ypbwis1o&raw=1",
    "logo": "https://www.dropbox.com/scl/fi/qejlnswidmtvujfxw4fcd/images-5.jpeg?rlkey=l2xizvzv6bdqf0l3t8jls7j5f&st=zrlufvjo&raw=1",
    "strength": [
      "Faith-Based Education: Combines academic excellence with moral and spiritual development, fostering holistic student growth.",
      "Community Engagement: Actively participates in societal development and service.",
      "Supportive Environment: Offers a nurturing and values-driven atmosphere for learning and character formation.",
      "Focus on Leadership: Prepares students to be ethical leaders in various sectors.",
      "Cultural Relevance: Incorporates Ghanaian and Christian values, appealing to a specific demographic."
    ],
    "weakness": [
      "Limited Program Diversity: May focus predominantly on theology and related disciplines, reducing appeal to broader academic interests.",
      "Smaller Scale: As a specialized institution, it may lack the infrastructure and resources of larger universities.",
      "Regional Reputation: May struggle with visibility and recognition outside its faith-based and regional community.",
      "Funding Constraints: Reliance on faith-based support could limit access to significant external funding for expansion and innovation."
    ],
    "g_video": "https://www.youtube.com/watch?v=ND0mtenDmUQ"
  },
  {
    "id": "11",
    "name": "Jackson Institute of Innovation and Leadership",
    "location": "Kumasi",
    "country": "Ghana",
    "region": "Ashanti Region",
    "town": "Accra",
    "type": "private",
    "note": "Jackson Institute of Innovation and Leadership (JIIL), part of the Jackson Educational Complex (JEC) established in 2009, emphasizes hands-on learning and leadership training across various sectors. As Ghana’s first private institution offering Bachelor and Diploma programs in Basic Education via Distance Learning, JIIL combines traditional academics with experiential learning and industry collaboration to prepare graduates for impactful careers.",
    "nick": "JIIL",
    "est_year": "2009",
    "rank": "Unknown",
    "application": "https://www.admissions.jiil.edu.gh/",
    "rate": "4.7",
    "reviews": "7 Google",
    "placement": "4.7",
    "hostel": "3.9",
    "facilities": "3.7",
    "sports": "3.9",
    "amenities": "3.6",
    "campus_number": "1",
    "campuses": [
      "Ghana Christian University College has only one campus in Kumasi. This is where all programmes are taken in person."
    ],
    "image": "https://www.dropbox.com/scl/fi/xnrzd65xfayj75dw3vdia/2021-04-23.jpg?rlkey=8plre1qc0jmbmu0ohc5gi46y2&st=4d1yh431&raw=1",
    "logo": "https://www.dropbox.com/scl/fi/t1ykbkatuaj48pfbdluks/picture.jpeg?rlkey=kc55f33sw3pgvlrxrobcy3mzn&st=23y274qs&raw=1",
    "strength": [
      "Pioneering Distance Learning: First private institution in Ghana to offer Bachelor and Diploma programs in Basic Education via Distance Learning.",
      "Hands-On Learning: Emphasis on experiential education through group projects, presentations, and real-world industry collaboration.",
      "Leadership Development: Focuses on training leaders across diverse societal sectors.",
      "Industry Partnership: Collaborates with organizations to ensure graduates are workforce-ready.",
      "Innovative Approach: Bridges academia and industry with inclusive, entrepreneurial, and innovative education."
    ],
    "weakness": [
      "Narrow Focus: Emphasis on education and leadership may limit appeal to students interested in broader academic disciplines.",
      "Relatively New Institution: Shorter history compared to older institutions could affect its reputation and influence.",
      "Resource Demands: Maintaining experiential learning and industry partnerships may require substantial resources and funding.",
      "Distance Learning Challenges: Potential issues with accessibility, engagement, and quality control in remote education delivery."
    ],
    "g_video": "https://web.facebook.com/JIILEDU/videos/welcome-to-jiil/740885336840199/?_rdc=1&_rdr"
  },
  {
    "id": "12",
    "name": "KAAF University College",
    "location": "Buduburam",
    "country": "Ghana",
    "region": "Central Region",
    "town": "Kasoa",
    "type": "private",
    "note": "Kaaf University College offers diverse undergraduate and graduate programs across health sciences, business, and law, fostering holistic education and career readiness. With expert faculty, state-of-the-art facilities, and a focus on critical thinking, it prepares students for impactful roles in their fields. Known for its contributions to healthcare, corporate, and legal sectors, Kaaf emphasizes community engagement, research, and societal development, creating a supportive and inclusive learning environment.",
    "nick": "KAAF",
    "est_year": "2006",
    "rank": "757th",
    "application": "https://portal.kaafuni.edu.gh/kuceportalonline/users2.php",
    "rate": "4.4",
    "reviews": "104 Google",
    "placement": "4.7",
    "hostel": "3.9",
    "facilities": "3.7",
    "sports": "3.9",
    "amenities": "3.6",
    "campus_number": "2",
    "campuses": [
      "KAAF University College has two  campuses in Ghana. The main campus in Buduburam, Kasoa. The other campuse is Accra City Campus, located in Darkuman, Dr Bussia Highway. This is where all programmes are taken in person."
    ],
    "image": "https://www.dropbox.com/scl/fi/o7vzeqpf6tf3yzj1te4v5/KAAF-University-College-Main-Campus-Buduburam-Ghana-SchoolFinder-TortoisePathcom.jpeg?rlkey=tpd0u64musj54r18v1bb7zws8&st=vpiwnl4e&raw=1",
    "logo": "https://www.dropbox.com/scl/fi/ix8ytgy896n9pt5x5zkah/images-6.jpeg?rlkey=zuqedny42r10w3axfw6alf4jy&st=h5j6npl0&raw=1",
    "strength": [
      "Diverse Academic Offerings: Wide range of undergraduate and graduate programs, including health sciences, business, and law.",
      "Expert Faculty: Distinguished professionals committed to fostering critical thinking and academic excellence.",
      "Modern Facilities: State-of-the-art resources provide a conducive learning environment.",
      "Healthcare Contributions: Recognized for its impact on healthcare education and development.",
      "Holistic Approach: Combines academic, extracurricular, and community engagement to foster well-rounded graduates.",
      "Inclusivity: Supportive community that encourages students to explore their potentia"
    ],
    "weakness": [
      "Private Institution Limitations: Higher tuition fees may limit accessibility for some students.",
      "Reputation Building: Competes with older, more established universities for recognition.",
      "Resource Challenges: Sustaining modern facilities and diverse programs may require significant funding.",
      "Regional Focus: May face challenges in gaining global visibility and appeal."
    ],
    "g_video": "https://www.youtube.com/watch?v=nqVbaDWB6rI"
  },
  {
    "id": "13",
    "name": "Garden City University College",
    "location": "Kenyasi",
    "country": "Ghana",
    "region": "Ashanti Region",
    "town": "Kumasi",
    "type": "private",
    "note": "Garden City University College was established in 2001 has eleven departments within the Faculties offering undergraduate programmes in business, health and applied sciences. Among its facilities are internet connectivity with Wi-Fi accessibility, fully equipped libraries, office equipment, state of the art hostel, simulation rooms, dental clinic, fully dedicated satellite system and many more.",
    "nick": "GCUC",
    "est_year": "2001",
    "rank": "364th",
    "application": "https://gcuc.edu.gh/gcucadmission/application",
    "rate": "4.2",
    "reviews": "273 Google",
    "placement": "4.2",
    "hostel": "3.9",
    "facilities": "3.7",
    "sports": "3.9",
    "amenities": "3.6",
    "campus_number": "3",
    "campuses": [
      "Garden City University College has three  campuses in Ghana. The main campus in Kumasi. The other campuses in Akim Oda and Berekum."
    ],
    "image": "https://www.dropbox.com/scl/fi/o7vzeqpf6tf3yzj1te4v5/KAAF-University-College-Main-Campus-Buduburam-Ghana-SchoolFinder-TortoisePathcom.jpeg?rlkey=tpd0u64musj54r18v1bb7zws8&st=vpiwnl4e&raw=1",
    "logo": "https://www.dropbox.com/scl/fi/ix8ytgy896n9pt5x5zkah/images-6.jpeg?rlkey=zuqedny42r10w3axfw6alf4jy&st=h5j6npl0&raw=1",
    "strength": [
      "Diverse Programs: Offers a variety of undergraduate and postgraduate programs tailored to meet industry demands.",
      "Healthcare Focus: Strong emphasis on health sciences, contributing to Ghana’s healthcare sector.",
      "Conducive Learning Environment: Equipped with modern facilities to support academic and extracurricular activities.",
      "Industry-Relevant Education: Curricula designed to prepare students for the workforce with practical skills.",
      "Community Engagement: Actively participates in societal development and outreach programs."
    ],
    "weakness": [
      "Regional Focus: Limited recognition outside Ghana, reducing its international appeal.",
      "Private Institution Challenges: Higher costs of education may deter students from lower-income backgrounds.",
      "Resource Dependency: Sustaining infrastructure and programs may require substantial and consistent funding.",
      "Limited Alumni Network: Relatively newer institution compared to older universities, impacting influence and partnerships.",
      "Program Range: May lack the diversity of offerings compared to comprehensive universities."
    ],
    "g_video": "https://www.youtube.com/watch?v=H3oZS6tORoc"
  },
  {
    "id": "14",
    "name": "Lancaster University",
    "location": "Tantra Hill, Achimota",
    "country": "Ghana",
    "region": "Greater Accra",
    "town": "Accra",
    "type": "private",
    "note": "Lancaster University Ghana aims to lead in higher education by offering a research-driven curriculum in a dynamic, innovative environment. It fosters a diverse, collaborative community that emphasizes research, social and environmental awareness, and practical, case-based learning to prepare students for local and global challenges.",
    "nick": "Lancaster",
    "est_year": "2013",
    "rank": "547th",
    "application": "https://lancaster.edu.gh/applying-to-lancaster-university",
    "rate": "4.6",
    "reviews": "95 Google",
    "placement": "4.2",
    "hostel": "4.0",
    "facilities": "3.7",
    "sports": "3.9",
    "amenities": "3.6",
    "campus_number": "1",
    "campuses": [
      "Lancaster University has a single campus in Tantra-Hill, Accra, this campus is the only British branch campus in West Africa. It offers undergraduate courses in business, management, international relations, computer science, law, psychology, and a global MBA program. Students will be taught by local and Lancaster academic staff."
    ],
    "image": "https://www.dropbox.com/scl/fi/vbbhovkpfrbbeb3vku76v/LUG-Campus-_4.JPG-1-scaled-800x533.jpg?rlkey=25rcm7imkb1sxhawtpz3l7cn0&st=22xlnhd6&raw=1",
    "logo": "https://www.dropbox.com/scl/fi/u59al48w2qfrdd9skpogi/images-7.jpeg?rlkey=3cswdmidxbu2m2ofyxpjos4sw&st=9krthiiu&raw=1",
    "strength": [
      "Research-Driven Curriculum: Emphasis on research and innovation aligns with global academic standards.",
      "Diverse Community: Promotes collaboration among students, faculty, and staff from various backgrounds.",
      "Practical Learning: Combines theoretical knowledge with case-based studies and real-world applications.",
      "Global Affiliation: Connection to the UK campus enhances reputation and access to resources.",
      "Progressive Vision: Focus on adaptability to local and global challenges fosters well-rounded graduates."
    ],
    "weakness": [
      "High Costs: Affiliation with an international university may lead to higher tuition fees, limiting accessibility.",
      "Limited Local Identity: Strong UK ties might overshadow efforts to establish a unique local identity in Ghana.",
      "Resource Intensive: Maintaining research-driven programs and facilities requires significant investment.",
      "Niche Focus: Concentration on research and innovation might limit appeal to students seeking traditional programs.",
      "Regional Competition: Faces competition from other institutions offering similar programs at lower costs."
    ],
    "g_video": "https://www.youtube.com/watch?v=ES5VVLtoRt8"
  },
  {
    "id": "15",
    "name": "Maranatha University College",
    "location": "Sowutuom",
    "country": "Ghana",
    "region": "Greater Accra",
    "town": "Accra",
    "type": "private",
    "note": "Maranatha University College (formerly Maranatha Bible College) was founded in 1972 through the vision of Mr. William Ofori Atta and Rev. John Bergen to train young Ghanaians in the Word of God for service. Established as a collaboration between Ghanaian believers and the Sudan Interior Mission, it operates as an autonomous institution. MUC has been instrumental in training leaders for town fellowship groups, contributing significantly to the religious community and the nation's spiritual growth.",
    "nick": "MUC",
    "est_year": "1972",
    "rank": "1056th",
    "application": "https://muc-gh.com/online-application",
    "rate": "4.1",
    "reviews": "65 Google",
    "placement": "4.2",
    "hostel": "3.9",
    "facilities": "3.7",
    "sports": "3.9",
    "amenities": "3.6",
    "campus_number": "1",
    "campuses": [
      "Maranatha University College has a single campus in Sowutuom, Accra, where all programmes are takne on-campus."
    ],
    "image": "https://www.dropbox.com/scl/fi/ljvpg4p5nf9nkfb4qdhpq/images-8.jpeg?rlkey=vi28jun3meth3tz2vd7esxioc&st=eu77m65j&raw=1",
    "logo": "https://www.dropbox.com/scl/fi/mb9kqewbfnpke56c58fcu/images-9.jpeg?rlkey=2k1oousmjksoodvdv9klqut3x&st=rpgzmz58&raw=1",
    "strength": [
      "Strong Religious Foundation: Rooted in a clear vision to train leaders in the Word of God for service.",
      "Legacy of Leadership Training: Successfully equips students to play key spiritual roles in communities and churches.",
      "Autonomy: Operates as an independent Ghanaian organization with strong local governance.",
      "Historical Significance: Founded by respected figures, contributing to its credibility and impact.",
      "Community Impact: Significant influence in fostering town fellowship groups and spiritual growth."
    ],
    "weakness": [
      "Limited Program Diversity: Focused primarily on theological and religious education, which may limit appeal.",
      "Small Scale: May not compete with larger institutions offering a broader range of programs.",
      "Resource Constraints: Potentially limited funding and facilities compared to secular universities.",
      "Narrow Market Appeal: Primarily attracts students interested in religious studies, restricting enrollment diversity.",
      "Modernization Challenges: May face difficulties adapting to contemporary educational demands and trends."
    ],
    "g_video": ""
  },
  {
    "id": "16",
    "name": "Radford University College",
    "location": "East Legon",
    "country": "Ghana",
    "region": "Greater Accra",
    "town": "Accra",
    "type": "private",
    "note": "Radford University College (RUC), affiliated with Kwame Nkrumah University of Science and Technology (KNUST), offers a diverse range of degree programs including Graphic Design, Fashion Design, Medical Laboratory Technology, and Business Administration. Renowned for its academic excellence, RUC features modern facilities, innovative teaching methods, and a qualified faculty. It is celebrated for pioneering Ghana’s first Bachelor’s degree program in Fashion Design, earning national and international recognition.",
    "nick": "MUC",
    "est_year": "2009",
    "rank": "398th",
    "application": "https://ruc.edu.gh/how-to-apply",
    "rate": "4.1",
    "reviews": "143 Google",
    "placement": "4.2",
    "hostel": "3.9",
    "facilities": "3.7",
    "sports": "3.9",
    "amenities": "3.6",
    "campus_number": "1",
    "campuses": [
      "Radford University College has a single campus in East Legony, Accra, where all programmes are takne on-campus."
    ],
    "image": "https://www.dropbox.com/scl/fi/dtlepy9yu8056shmt7zu1/Radford-University-College-Accra-Ghana-SchoolFinder-TortoisePathcom-1.jpeg?rlkey=4bn1o977sybb0jkw9s6pk3hm7&st=thmowl9q&raw=1",
    "logo": "https://www.dropbox.com/scl/fi/dbsglbsmlgvem1h801tp8/download-2.jpeg?rlkey=y1lx9cegahx8yn3zi9hgd76r4&st=kk81ljvs&raw=1",
    "strength": [
      "Strong Affiliation: Partnership with KNUST enhances credibility and academic standards.",
      "Program Diversity: Offers a wide range of industry-relevant degree programs.",
      "Innovative Leadership: Pioneer of Ghana’s first Bachelor’s program in Fashion Design.",
      "Modern Facilities: Equipped with advanced labs, studios, and libraries to support learning.",
      "Strategic Location: Situated in Accra, providing accessibility and exposure to opportunities.",
      "Academic Reputation: Recognized for excellence, with graduates excelling globally."
    ],
    "weakness": [
      "Limited Reach: Focused primarily on urban students due to its Accra location.",
      "Resource Dependence: Reliance on KNUST for accreditation and academic oversight.",
      "Specialized Recognition: Strong in Fashion Design but less visibility in other programs.",
      "Competition: Faces challenges from larger universities offering similar programs.",
      "Scalability: Potential constraints in expanding infrastructure and resources for increasing demand."
    ],
    "g_video": "https://web.facebook.com/RadfordUC/videos/3038436229768100/"
  },
  {
    "id": "17",
    "name": "Regentropfen University College",
    "location": "Bongo",
    "type": "private",
    "note": "Regentropfen University College, accredited in 2016, is a people-centered institution dedicated to training innovative researchers, engineers, and entrepreneurial leaders with practical skills, critical thinking, and a commitment to societal transformation. With a focus on human-centered management and talent promotion, it prepares students to create jobs and drive socio-economic growth in West Africa",
    "nick": "Recas",
    "campus_number": "1",
    "campuses": [
      "Regentropfen College of Applied Sciences has a single campus in  Bongo, Bolgatanga, where all programs are offered on-site.",
      "There are currently no distance learning options for programmes."
    ],
    "image": "https://www.dropbox.com/scl/fi/hpqzjc4m098pef690a08g/images-1.jpeg?rlkey=iwlfwmtovjv9lza1qjx31iu12&st=d6kvl0r8&raw=1",
    "logo": "https://www.dropbox.com/scl/fi/v2bprl3o8c9v7jj1xkavp/1000088792-removebg-preview.png?rlkey=2428vw1adiptyeovjcxtdn1ej&st=k2tieulb&raw=1",
    "country": "Ghana",
    "region": "Upper East",
    "town": "Bolgatanga",
    "est_year": "2016",
    "rank": "467th",
    "application": "https://admission.regentropfen.edu.gh/user/login.php",
    "rate": "4.6",
    "reviews": "13 Google",
    "placement": "4.5",
    "hostel": "3.5",
    "facilities": "3.4",
    "sports": "3.9",
    "amenities": "3.5",
    "strength": [
      "Practical Training Focus: Emphasis on hands-on knowledge ('Do-How ability') equips students with real-world skills.",
      "Entrepreneurial Development: Prepares students to create jobs, fostering market-oriented entrepreneurs.",
      "Human-Centered Approach: Prioritizes stakeholder value and student well-being in its management and education.",
      "Regional Impact: Aims to address socio-economic challenges in the West African sub-region.",
      "Talent Promotion: Supports diverse talents with a conducive learning environment for future readiness."
    ],
    "weakness": [
      "Relatively New Institution: Limited reputation and alumni network compared to older universities.",
      "Regional Focus: May limit appeal to students and stakeholders outside West Africa.",
      "Resource Constraints: As a growing institution, it may face challenges in scaling infrastructure and programs.",
      "Specialization Limitations: Emphasis on entrepreneurship and applied sciences might restrict broader academic offerings."
    ],
    "g_video": "https://youtu.be/sSaobcygl94?si=URPlHNHCWdSumoGq"
  },
  {
    "id": "18",
    "name": "Spiritan University College",
    "location": "Abankoro, Ejisu",
    "type": "private",
    "note": "Spiritan University College, established in 1990 as an Institute of Philosophy, evolved to offer diplomas and degrees, becoming a University College in 2008 through accreditation and partnership with KNUST. It now provides diverse programs in Philosophy, Social Sciences, and Business Studies, combining Catholic education with academic excellence to serve the youth of Ghana and Africa.",
    "nick": "SUC",
    "campus_number": "1",
    "campuses": [
      "Spiritan University College has a single campus in  Abankoro Ejisu, Kumasi, where all programs are offered on-site.",
      "They are currently affiliated to University of Cape Coast for selected distance learning programs."
    ],
    "image": "https://www.dropbox.com/scl/fi/39kttrogodrfvcu63bdjm/download-1.jpeg?rlkey=rnlt195jfdxo6nwxo8ssjw95b&st=l698yxz3&raw=1",
    "logo": "https://www.dropbox.com/scl/fi/vn2ke9bn7i4j7xwqeuyvt/images-1.jpeg?rlkey=eznul7duuoxekt4jx164v9zkj&st=1q7qpyo6&raw=1",
    "country": "Ghana",
    "region": "Ashanti Region",
    "town": "Kumasi",
    "est_year": "1990",
    "rank": "981th",
    "application": "https://suc.edu.gh/admissions",
    "rate": "4.2",
    "reviews": "26 Google",
    "placement": "4.5",
    "hostel": "3.5",
    "facilities": "3.4",
    "sports": "3.9",
    "amenities": "3.5",
    "strength": [
      "Rich Heritage: Founded with strong Catholic and Spiritan traditions, fostering values-driven education.",
      "Diverse Academic Programs: Offers a wide range of accredited programs in Philosophy, Social Sciences, and Business Studies.",
      "Strategic Partnership: Collaboration with KNUST enhances academic credibility and degree recognition.",
      "Inclusive Education: Expanded from religious training to serve the wider public, benefiting students across Ghana and Africa.",
      "Commitment to Excellence: Consistently re-accredited, ensuring quality education and relevance."
    ],
    "weakness": [
      "Limited Regional Influence: Primarily caters to Ghana and nearby regions, with less international outreach.",
      "Resource Challenges: As a smaller institution, may face constraints in infrastructure and funding compared to larger universities.",
      "Newer Business Programs: Some programs, especially in Business Studies, are relatively young and still building reputation.",
      "Dependency on Partnerships: Heavy reliance on KNUST for degree validation could limit autonomy."
    ],
    "g_video": "https://youtu.be/-HMzrrDv88o?si=JkvK7jdGm28ydMtF"
  },
  {
    "id": "19",
    "name": "Mountcrest University College",
    "location": "Kanda, Ablade Road",
    "type": "private",
    "note": "MountCrest University College (MCU), established in 2008, is a leading private institution in Ghana with accredited programs in Law, Public Health, Social Work, and more. Known for hosting Ghana's premier private law faculty, MCU operates campuses in Accra and Larteh-Akuapem and is affiliated with KNUST. It is also working to establish the first medical school in rural Ghana.",
    "nick": "MUC",
    "campus_number": "1",
    "campuses": [
      "Mountcrest University College ankoro Kanda, Accra, where all programs are offered on-site.",
      "They are affiliated to KNUST. They have both Evening & Weekend class on selected programmes."
    ],
    "image": "https://www.dropbox.com/scl/fi/oqf38kev30xjt6s6ywusw/download-1.jpeg?rlkey=ultcmyfhap2jpyili1iyju6gk&st=wluyqewz&raw=1",
    "logo": "https://www.dropbox.com/scl/fi/aj879z9u6kwvhzhrdzi7a/1000089382-removebg-preview.png?rlkey=ttejng1d1k0vyrppargsfjpsz&st=nsbuv4i3&raw=1",
    "country": "Ghana",
    "region": "Greater Accra",
    "town": "Accra",
    "est_year": "2008",
    "rank": "428th",
    "application": "https://mountcrestuniversity.edu.gh/apply",
    "rate": "4.6",
    "reviews": "43 Google",
    "placement": "4.5",
    "hostel": "3.5",
    "facilities": "3.4",
    "sports": "3.9",
    "amenities": "3.5",
    "strength": [
      "Diverse Academic Offerings: Accredited programs in Law, Public Health, Social Work, and more provide broad academic opportunities.",
      "Pioneering Law Faculty: Hosts Ghana’s premier private law faculty, setting it apart in legal education.",
      "Rural Focus: Plans to establish the first medical school in rural Ghana demonstrate commitment to underserved areas.",
      "Strategic Locations: Operates campuses in Accra and Larteh-Akuapem, ensuring accessibility and connection to urban and rural communities.",
      "Strong Affiliation: Collaboration with KNUST enhances academic quality and degree recognition."
    ],
    "weakness": [
      "Relatively Young Institution: Limited alumni network and institutional reputation compared to older universities.",
      "Resource Constraints: May face challenges in expanding infrastructure, especially for the planned rural medical school.",
      "Limited International Presence: Primarily focused on local and regional impact, with less global reach.",
      "Multiple Campuses: Managing resources and operations across urban and rural campuses could present logistical challenges."
    ],
    "g_video": "https://web.facebook.com/mountcrestuni.college/videos/odamea-amoako-student-writeswhen-i-finally-decided-to-pursue-legal-education-i-w/3580970425463987/?_rdc=1&_rdr"
  },
  {
    "id": "20",
    "name": "Perez University College",
    "location": "Gomoa Pomadze",
    "country": "Ghana",
    "region": "Central Region",
    "town": "Winneba",
    "type": "private",
    "note": "Perez University College, an initiative of Perez Chapel International, began as a Bible College in 1992 in Tamale and later relocated to Accra. Renamed in 2013, it acquired Pan African Christian University College in 2015, becoming a private university in Pomadze-Winneba. The college now comprises the School of Business and School of Theology.",
    "nick": "Perez",
    "campus_number": "1",
    "campuses": [
      "Perez University College has a single campus in Gomoa Pomadze, Winneba, where all programs are offered on-campus.",
      "They have Weekend class on selected students and programmes."
    ],
    "image": "https://www.dropbox.com/scl/fi/34mai7vxuvik7ogukn2aq/P1020897.JPG?rlkey=0exdsx560rmre6g2i520qlc5j&st=2v8mcp4t&raw=1",
    "logo": "https://www.dropbox.com/scl/fi/p5v80a0nveq3uol98vjx0/1000089438-removebg-preview.png?rlkey=60ucnp6l81h2j4a2eckhtsapx&st=xsnx6w9r&raw=1",
    "est_year": "1992",
    "rank": "961th",
    "application": "https://perez.edu.gh/apply-now",
    "rate": "3.8",
    "reviews": "17 Google",
    "placement": "4.5",
    "hostel": "3.5",
    "facilities": "3.4",
    "sports": "3.9",
    "amenities": "3.5",
    "strength": [
      "Strong Religious Foundation: Rooted in Perez Chapel International, promoting values-driven education.",
      "Diverse Offerings: Houses the School of Business and School of Theology, catering to both secular and religious education.",
      "Strategic Acquisition: Acquisition of Pan African Christian University College adds credibility and history to its profile.",
      "Accessible Location: Positioned near Winneba with good connectivity, enhancing accessibility for students.",
      "Experience in Ministry Training: Decades of expertise in theological education since its inception as a Bible College."
    ],
    "weakness": [
      "Limited Academic Scope: Focus on theology and business may restrict appeal to students seeking diverse fields of study.",
      "Regional Reach: Primarily caters to local and regional communities with limited international presence.",
      "Dependency on Religious Affiliation: Strong ties to Perez Chapel may limit its appeal to non-religious students.",
      "Relatively New: Despite its history, it is still building its reputation and alumni network as a university."
    ],
    "g_video": "https://web.facebook.com/PerezUniversity/videos/admission-admission-admission/425107099364967/?_rdc=1&_rdr"
  },
  {
    "id": "21",
    "name": "Lakeside University College",
    "location": "Adenta",
    "country": "Ghana",
    "region": "Greater Accra",
    "town": "Accra",
    "type": "private",
    "note": "Lakeside University College, Ghana (LUCG), formerly the Madina Institute of Science and Technology, was established in 2013 by the Madina Foundation for Science and Technology (MFST) with support from Al-Diya, aiming to empower youth in underserved communities through quality science and technology education. Accredited in 2016, LUCG began operations with 70 students and four degree programs. Today, it offers six accredited programs across three schools, with a student population of 372 from four countries. The university has graduated three cohorts, with an alumni network of approximately 180 students.",
    "nick": "LUCG",
    "est_year": "2013",
    "rank": "Unknown",
    "application": "https://services.lucg.edu.gh/admission/auth-pin",
    "rate": "4.5",
    "reviews": "22 Google",
    "placement": "4.2",
    "hostel": "3.9",
    "facilities": "3.7",
    "sports": "3.9",
    "amenities": "3.6",
    "campus_number": "1",
    "campuses": [
      "Lakeside University College has one campus. The university has four schools: School of Engineering, School of Business and Technology, Business Administration, and School of Arts. LUCG is a private nonprofit university in Accra, Ghana. It was established by the Madina Foundation."
    ],
    "image": "https://www.dropbox.com/scl/fi/4wkoi3s3k65dm2byuzubt/download-6.jpeg?rlkey=e32iv73ckbyc3ixyk00qywwoc&st=tb40fq5r&raw=1",
    "logo": "https://www.dropbox.com/scl/fi/rr8z2wjvjp1frz1zymyyg/1000090292-removebg-preview.png?rlkey=u6nkrz3w2eunczcniehfe1rwh&st=ibaukvei&raw=1",
    "strength": [
      "Focus on Science and Technology: Emphasizes education in fields critical for societal advancement.",
      "Targeting Underserved Communities: Aims to provide quality education to disadvantaged youth.",
      "Accreditation: Recognized by the Ghana Tertiary Education Commission, ensuring credibility.",
      "Diverse Student Body: Attracts students from multiple countries, promoting cultural exchange.",
      "Growth in Offerings: Expanded from four to six degree programs since inception."
    ],
    "weakness": [
      "Limited Alumni Base: With only 180 graduates, the alumni network is relatively small.",
      "Modest Student Enrollment: The current population of 372 indicates room for growth.",
      "Resource Constraints: Likely dependent on external support from NGOs for operations.",
      "Low Visibility: Still building its reputation and presence within Ghana’s higher educaon sector.",
      "Geographic Scope: Predominantly serving local communities, limiting broader impact."
    ],
    "g_video": "https://web.facebook.com/lucghana/videos/3123395564615938/"
  },
  {
    "id": "22",
    "name": "Knutsford University College",
    "location": "Bamako, East Legon",
    "country": "Ghana",
    "region": "Greater Accra",
    "town": "Accra",
    "type": "private",
    "note": "Knutsford University College, established in 2007, addresses the need for affordable, high-quality university education in Ghana and beyond. Accredited by the Ghana Tertiary Education Commission (GTEC) the same year, the institution is known for its excellent facilities, transformative programs, and partnerships, including mentorship and degree conferment agreements with the University of Ghana (since 2011) and the University for Development Studies (since 2017). Starting with 25 students in 2008, Knutsford has grown significantly, serving thousands across its campuses in East Legon, Accra, and Kumasi.",
    "nick": "Knutsford",
    "est_year": "2007",
    "rank": "601st",
    "application": "https://pyrosys.co/kucnew/admissions/verify-voucher",
    "rate": "4.5",
    "reviews": "168 Google",
    "placement": "4.2",
    "hostel": "3.9",
    "facilities": "3.7",
    "sports": "3.9",
    "amenities": "3.6",
    "campus_number": "2",
    "campuses": [
      "Knutsford University College has two campuses: one in Accra and one in Kumasi:",
      "Accra - Located at 10 Bamako Street, East Legon, Accra, Ghana. It's about a 10-minute drive from Kotoka International Airport and the University of Ghana.",
      "Kumasi - Located at GBC Street, Plot 13 Blk, Opposite Bomso Clinic, Kumasi, Ghana. It's about a 25-minute drive from the regional airport."
    ],
    "image": "https://www.dropbox.com/scl/fi/s9pn0b6jgcoqnfnmctbfv/download.jpeg?rlkey=ujrj1tcifug4xc0qfz30on77i&e=1&st=z9et88xb&raw=1",
    "logo": "https://www.dropbox.com/scl/fi/6gfl0qj8gdm02im8jv7bt/1000090456-removebg-preview.png?rlkey=1pkc5ydzx408gmaxy3q56k1yc&st=pjanxgx7&raw=1",
    "strength": [
      "Accreditation and Partnerships: Accredited by GTEC and affiliated with prestigious institutions like the University of Ghana and the University for Development Studies.",
      "Significant Growth: Expanded from 25 students to thousands, reflecting its appeal and impact.",
      "Strategic Location: Main campus in East Legon, near Kotoka International Airport, with an additional campus in Kumasi.",
      "High-Quality Facilities: Offers exceptional academic resources and a conducive learning environment.",
      "Affordable Education: Provides accessible, high-quality programs for a diverse student body."
    ],
    "weakness": [
      "Limited Global Recognition: Needs to strengthen its international reputation and collaborations.",
      "Reliance on Affiliations: Degree conferment depends on partner institutions, potentially limiting autonomy.",
      "Resource Strain: Rapid growth may challenge infrastructure and faculty capacity.",
      "'Geographic Concentration: Expansion is primarily within Ghana, limiting broader regional influence.",
      "Late Adoption of Multi-Campus Model: The second campus was only established later, which may have slowed earlier expansion."
    ],
    "g_video": "https://www.youtube.com/watch?v=PYQfaDbyFrU"
  },
  {
    "id": "23",
    "name": "Entrance University College of Health Sciences",
    "location": "Spintex",
    "country": "Ghana",
    "region": "Greater Accra",
    "town": "Accra",
    "type": "private",
    "note": "Entrance University of Health Sciences is the first private university in the West African sub-region to offer the Doctor of Pharmacy degree. Affiliated with Kwame Nkrumah University of Science and Technology (KNUST), the university emphasizes experiential learning and state-of-the-art facilities. Situated in Spintex, Accra, Ghana, EUHS boasts well-equipped lecture rooms, laboratories, a library, and convenient off-campus hostel accommodations with shuttle services. The institution is committed to Ghana's socio-economic development and embraces its role in the global academic community.",
    "nick": "EUHS",
    "est_year": "2018",
    "rank": "Unknown",
    "application": "https://euhs.edu.gh/SignUp/",
    "rate": "4.6",
    "reviews": "20 Google",
    "placement": "4.2",
    "hostel": "3.9",
    "facilities": "3.7",
    "sports": "3.9",
    "amenities": "3.6",
    "campus_number": "1",
    "campuses": [
      "Entrance University College of Health Sciences has a single  campus in Spintex, Accra. This is where all their academic activities are held"
    ],
    "image": "https://www.dropbox.com/scl/fi/rgos1gw4ylgfpmzgvdvac/images-1.jpeg?rlkey=8xl9cvbrlnnfz7c0m4fftqd1v&st=91cxhirv&raw=1",
    "logo": "https://www.dropbox.com/scl/fi/jz09qg0kdm4pze8u669aw/1000090466-removebg-preview.png?rlkey=z55vjrcm886w49gbh0wct0g6c&st=q40pjglt&raw=1",
    "strength": [
      "Pioneering Program: The first private university in West Africa to offer a Doctor of Pharmacy degree.",
      "Experiential Learning: Focuses on hands-on education to enhance student proficiency.",
      "Affiliation with KNUST: Ensures academic credibility and access to expertise.",
      "Modern Facilities: State-of-the-art lecture rooms, laboratories, and library resources.",
      "Convenient Location and Accommodation: Prime Spintex location and nearby hostel facilities with shuttle services.",
      "Global Outlook: Committed to integrating into the global academic and socio-economic landscape."
    ],
    "weakness": [
      "Limited Program Diversity: Focuses primarily on health sciences, potentially restricting broader student appeal.",
      "Relatively New Institution: May face challenges in establishing a strong reputation compared to older universities.",
      "Geographic Accessibility: Limited to Spintex, which may not be convenient for students outside Accra.",
      "Dependence on Affiliation: Relies on KNUST for academic credibility, which may limit autonomy.",
      "Competition: Competes with other established health science institutions in Ghana and beyond."
    ],
    "g_video": "https://www.youtube.com/watch?v=PU7bGPbDX3g"
  },
  {
    "id": "24",
    "name": "West End University College",
    "location": "Ngleshie Amanfro",
    "country": "Ghana",
    "region": "Greater Accra",
    "town": "Accra",
    "type": "private",
    "note": "West End University College (WEUC), established in 2010 and situated in Ngleshie-Amanfro, Accra, is an independent, non-denominational tertiary institution accredited by the National Accreditation Board and affiliated with the University of Cape Coast. WEUC offers comprehensive programs and services aimed at addressing societal educational and technical needs through learning, research, and outreach, fostering leadership, innovation, and social stewardship.",
    "nick": "WEUC",
    "est_year": "2010",
    "rank": "910th",
    "application": "https://weuc.edu.gh/admissions",
    "rate": "4.4",
    "reviews": "74 Google",
    "placement": "4.2",
    "hostel": "3.9",
    "facilities": "3.7",
    "sports": "3.9",
    "amenities": "3.6",
    "campus_number": "1",
    "campuses": [
      "West End University College has only campus in Ngleshie Amanfro, which  is accredited by the National Accreditation Board (NAB) of the Ministry of Education. WEUC is also affiliated with the University of Cape Coast (UCC). This is where all their academic activities are held"
    ],
    "image": "https://www.dropbox.com/scl/fi/nj8r4dbgk5eto3r9jc63f/img_2_1736110691956.jpg?rlkey=3wrjofl20abd80kx8jyqxi5ge&st=fbqtxgod&raw=1",
    "logo": "https://www.dropbox.com/scl/fi/hsbhbo7ba59522c31xiz2/1000090479-removebg-preview.png?rlkey=14cns4yde6nd951qx35yk9dyp&st=oy0l26g6&raw=1",
    "strength": [
      "Accreditation and Affiliation: Accredited by the National Accreditation Board and affiliated with the University of Cape Coast, ensuring academic credibility and recognition.",
      "Comprehensive Programs: Offers a wide range of programs that address societal and technical needs, fostering innovation and leadership.",
      "Urban Location: Situated in Ngleshie-Amanfro, Accra, with proximity to major city amenities, providing accessibility to students.",
      "Mission-Driven Focus: Strong emphasis on leadership, organizational change, and social stewardship, aligning education with societal development.",
      "Modern Facilities: Urban setting conducive to learning and research activities."
    ],
    "weakness": [
      "Relatively New Institution: Established in 2010, WEUC may face challenges competing with older, more established universities in terms of reputation and alumni network.",
      "Limited International Recognition: As a local institution, it may lack the global presence or partnerships necessary for international competitiveness.",
      "Narrow Urban Focus: Located in the urban periphery, the institution may have limited appeal to students from rural or remote areas.",
      "Potential Resource Constraints: As a private institution, maintaining state-of-the-art facilities and extensive research funding could be challenging without robust financial support."
    ],
    "g_video": "https://www.youtube.com/watch?v=aj47b2qlZbA"
  },
  {
    "id": "25",
    "name": "Zenith University College",
    "location": "La",
    "country": "Ghana",
    "region": "Greater Accra",
    "town": "Accra",
    "type": "private",
    "note": "Zenith University College, established in 2001 as a subsidiary of EPP Books Services by entrepreneur and philanthropist Mr. Gibrine Adam, is a leading private university in Accra, Ghana, dedicated to professional and academic excellence. Accredited as a tertiary institution in 2005, ZUC offers diploma, undergraduate, and postgraduate programs, focusing on business, law, and public administration to address Ghana's human resource needs. With a commitment to quality teaching, innovative learning, and fostering global perspectives, the college attracts students from diverse nationalities and has evolved from a tutorial college to a center of excellence with multiple faculties, including the School of Professional Studies and the Faculty of Business Administration.",
    "nick": "ZUC Ghana",
    "est_year": "2001",
    "rank": "514th",
    "application": "https://www.zucghana.org/site/contents/download_page/4",
    "rate": "4.1",
    "reviews": "159 Google",
    "placement": "4.2",
    "hostel": "3.9",
    "facilities": "3.7",
    "sports": "3.9",
    "amenities": "3.6",
    "campus_number": "1",
    "campuses": [
      "Zenith University college has only one campus in La Accra, which  is accredited by the National Accreditation Board (NAB) of the Ministry of Education. ZUC Ghana is also affiliated with the University of Cape Coast (UCC). This is where all their academic activities are held"
    ],
    "image": "https://www.dropbox.com/scl/fi/g8lwh0of0xu1vdg211g3m/zenith-university-college.jpg?rlkey=mfjc3o9tj215xb1sz07avyh0k&st=uk409osu&raw=1",
    "logo": "https://www.dropbox.com/scl/fi/j0p6c8j9jsl36mqgf28y0/1000091014-removebg-preview.png?rlkey=7oed2m8rqdoleb9m4ow0bx8oo&st=041pvb6p&raw=1",
    "strength": [
      "Academic Excellence: Renowned for its professional and academic programs in business, law, and public administration, which address crucial industry and societal needs.",
      "Diverse Programs: Offers a range of diploma, undergraduate, and postgraduate programs, attracting students from various countries.",
      "Qualified Faculty: Employs exceptional faculty dedicated to innovative teaching and advancing knowledge.",
      "Global Outlook: Focuses on creating a global educational experience, fostering diversity and cross-cultural understanding.",
      "Founder's Vision: Strong entrepreneurial leadership from Mr. Gibrine Adam, whose other successful ventures bolster the institution's credibility and resources.",
      "Accreditation and Affiliations: Accredited by Ghanaian authorities, lending credibility and recognition to its qualifications."
    ],
    "weakness": [
      "Narrow Program Focus: Primarily centered on business and law, which may limit appeal to students interested in other fields.",
      "Location Constraints: Based in Accra, potentially reducing accessibility for students in other parts of the country or region.",
      "Reputation Challenges: As a relatively young institution compared to older universities, it may still be building its reputation globally.",
      "Resource Limitations: Despite its efforts, may face challenges in competing with larger or more established universities in terms of infrastructure and research output.",
      "Dependence on Founder's Influence: Heavy reliance on the founder’s vision and network could be a risk if succession planning and institutional independence are not adequately addressed."
    ],
    "g_video": "https://web.facebook.com/zenithuniversitycollege/videos/239366731883107/?_rdc=1&_rdr"
  },
  {
    "id": "26",
    "name": "Webster University",
    "location": "East Legon",
    "country": "Ghana",
    "region": "Greater Accra",
    "town": "Accra",
    "type": "private",
    "note": "Webster University Ghana, established in 2013, is part of the globally renowned Webster University network, which was founded in 1915 in St. Louis, Missouri, USA. It offers students in Ghana the opportunity to earn internationally recognized degrees while benefiting from a diverse and dynamic learning environment that blends global perspectives with local relevance.",
    "nick": "Webster",
    "est_year": "2013",
    "rank": "646th",
    "application": "https://events.webster.edu/signup?school_id=65",
    "rate": "4.6",
    "reviews": "77 Google",
    "placement": "4.2",
    "hostel": "3.9",
    "facilities": "3.7",
    "sports": "3.9",
    "amenities": "3.6",
    "campus_number": "1",
    "campuses": [
      "Webster University has only one campus in East Legon Accra, which  is accredited by the National Accreditation Board (NAB) of the Ministry of Education. ZUC Ghana is also affiliated with the University of Ghana. This is where all their academic activities are held"
    ],
    "image": "https://www.dropbox.com/scl/fi/q4p1abyppm3a0dzc4797y/Recommended.jpg?rlkey=fvdw6acxewjsmkf819omcy0a7&st=2wd22ue5&raw=1",
    "logo": "https://www.dropbox.com/scl/fi/an9d881jjy6ijnzvhu2p2/1000091026-removebg-preview.png?rlkey=fe3348d9ygzij0iwpe3jpjpn5&st=mvz4q1oa&raw=1",
    "strength": [
      "Accredited and recognized for academic excellence.",
      "Part of the prestigious global Webster University network.",
      "Offers diverse, internationally focused programs.",
      "Modern facilities with an emphasis on technology and innovation.",
      "Strong international student and faculty presence, fostering diversity."
    ],
    "weakness": [
      "Limited local reputation compared to older Ghanaian universities.",
      "Higher tuition fees may restrict accessibility for some students.",
      "Relatively small campus size compared to other institutions."
    ],
    "g_video": "https://web.facebook.com/hencheducation/videos/tour_websteruniversitywebster-university-ghana-campusthe-nearest-to-the-best-you/276115956379637/?_rdc=1&_rdr"
  },
  {
    "id": "27",
    "name": "Wisconsin International University College",
    "location": "North Legon",
    "country": "Ghana",
    "region": "Greater Accra",
    "town": "Accra",
    "type": "private",
    "note": "Wisconsin International University College, established in 1998. Wisconsin is affiliated to  University of Ghana, University of Cape Coast, Kwame Nkrumah University of Science and Technology and  University for Development Studies. It was the first private university to run an MBA programme in Ghana with nine (9) International MBA students under Rev. David Asante Dartey, as the Director, and Togbe Kwao Anipati IV, as Dean of Academic Studies.",
    "nick": "Wisconsin",
    "est_year": "1998",
    "rank": "647th",
    "application": "https://wiuc-ghana.edu.gh/how-to-apply/",
    "rate": "4.3",
    "reviews": "563 Google",
    "placement": "4.2",
    "hostel": "3.9",
    "facilities": "3.7",
    "sports": "3.9",
    "amenities": "3.6",
    "campus_number": "2",
    "campuses": [
      "Wisconsin International University College University has two main campuses Ghana. The main campus located in Agbogba, North Legon, Accra and the other campus in Feyiase, Atonso, Kumasi. This is where all their academic activities are held."
    ],
    "image": "https://www.dropbox.com/scl/fi/t3tgjc4n2k2lih95245wq/images-1.jpeg?rlkey=llqlr1k0ywtl5lvo2z3gcc4i2&e=1&st=doapfq6m&raw=1",
    "logo": "https://www.dropbox.com/scl/fi/3wo0qgfdvaged7bu4qpkx/images.png?rlkey=9kfvpjk6kiyoz4fn6bm70oghf&e=1&st=7zajjza4&raw=1",
    "strength": [
      "Offers diverse programs across various disciplines, including Business, Law, IT, and Nursing.",
      "Affiliated with prestigious institutions such as the University of Ghana, enhancing the credibility and recognition of its degrees.",
      "Strong emphasis on quality education and student-centered learning.",
      "Located in Accra, providing accessibility and exposure to a vibrant urban environment.",
      "Equipped with modern facilities, including libraries and ICT labs, to support academic and professional growth."
    ],
    "weakness": [
      "Limited campus size compared to other universities, which may restrict future expansion.",
      "Reliance on affiliations for academic recognition instead of independent accreditation for some programs.",
      "High competition from other established universities in Ghana and the West African region.",
      "Relatively young institution, which may lack the extensive alumni network of older universities."
    ],
    "g_video": "https://web.facebook.com/reel/444042151841111"
  },
  {
    "id": "28",
    "name": "University Of Ghana",
    "location": "Legon",
    "country": "Ghana",
    "region": "Greater Accra",
    "town": "Accra",
    "type": "public",
    "note": "The University of Ghana, established on August 11, 1948, as the University College of the Gold Coast, was founded following recommendations by the Asquith and Elliot Commissions to provide higher education in British colonies. Initially affiliated with the University of London, it aimed to uphold high academic standards through the guidance of the Inter-Universities Council. The institution's establishment was championed by leaders like Dr. J.B. Danquah and supported by Principal David Mowbray Balme, who laid the foundation for its academic excellence. Today, the University is governed by a central administration, a collegiate system, and a School of Graduate Studies, emphasizing research, teaching, and learning to make a national and international impact.",
    "nick": "UG",
    "est_year": "1948",
    "rank": "11th",
    "application": "https://admissions.ug.edu.gh",
    "rate": "4.5",
    "reviews": "3,374 Google",
    "placement": "4.1",
    "hostel": "4.3",
    "facilities": "4.5",
    "sports": "4.1",
    "amenities": "4.4",
    "campus_number": "2",
    "campuses": [
      "The University of Ghana has five main campuses : ",
      "Legon Campus: The main campus, where most of the university's teaching and research takes place. The campus is located 13 kilometers northeast of Accra and houses the central administration and the university's five traditional Halls.",
      "Korle-Bu Campus: One of the five main campuses of the University of Ghana",
      "Accra City Campus: One of the five main campuses of the University of Ghana",
      "Kumasi City Campus: One of the five main campuses of the University of Ghana",
      "Takoradi City Campus: One of the five main campuses of the University of Ghana"
    ],
    "image": "https://www.dropbox.com/scl/fi/j7cjt1tvl5dm6wt5t8upv/ug.jpeg?rlkey=fpm9z0aq2aqfya90ee0gycpuy&st=1hdg61yk&raw=1",
    "logo": "https://www.dropbox.com/scl/fi/44h14lfs74ox8chzw6x6g/uog.png?rlkey=nqhp3r45ymq0kabp58n6woggb&st=ffas3lap&raw=1",
    "strength": [
      "Offers diverse programs across various disciplines, including Business, Law, IT, and Nursing.",
      "Affiliated with prestigious institutions such as the University of Ghana, enhancing the credibility and recognition of its degrees.",
      "Strong emphasis on quality education and student-centered learning.",
      "Located in Accra, providing accessibility and exposure to a vibrant urban environment.",
      "Equipped with modern facilities, including libraries and ICT labs, to support academic and professional growth."
    ],
    "weakness": [
      "Limited campus size compared to other universities, which may restrict future expansion.",
      "Reliance on affiliations for academic recognition instead of independent accreditation for some programs.",
      "High competition from other established universities in Ghana and the West African region.",
      "Relatively young institution, which may lack the extensive alumni network of older universities."
    ],
    "g_video": "https://www.youtube.com/watch?v=c_ORgGRddsc"
  },
  {
    "id": "29",
    "name": "Kwame Nkrumah University  Of  Science And Tecnology",
    "location": "Kumasi",
    "country": "Ghana",
    "region": "Ashanti Region",
    "town": "Kumasi",
    "type": "public",
    "note": "Kwame Nkrumah University of Science and Technology (KNUST) transitioned to a decentralized Collegiate System in January 2005 to enhance administrative efficiency and academic operations, addressing challenges posed by an expanding student population and faculty structures. Situated on a scenic 16-square-kilometer campus in Kumasi, the university boasts modern facilities, verdant surroundings, and six Halls of Residence, alongside hostels for undergraduate and postgraduate students. Established to train scientists and technologists for Ghana and beyond, KNUST awards degrees independently since 1964, with external examiners ensuring high academic standards. The campus is a hub of innovation, academic excellence, and technological education in Africa.",
    "nick": "KNUST",
    "est_year": "1951",
    "rank": "22nd",
    "application": "https://apps.knust.edu.gh/admissions",
    "rate": "4.5",
    "reviews": "5,044 Google",
    "placement": "4.1",
    "hostel": "4.3",
    "facilities": "4.5",
    "sports": "4.1",
    "amenities": "4.4",
    "campus_number": "2",
    "campuses": [
      "The Kwame Nkrumah University of Science and Technology (KNUST) Ghana has two campuses: Kumasi and Obuasi.",
      "The KNUST campus in Kumasi is 16 square kilometers in size and is located about seven kilometers from the central business district of Kumasi. The campus features modern buildings, lawns, tropical flora, halls of residence, hostels, an administration block, a library, and a Great Hall.",
      "It is however worth noting that KNUST has learning centers almost in the 16 regions of Ghana"
    ],
    "image": "https://www.dropbox.com/scl/fi/0vid8u2r53lv8jq59392e/images-14.jpeg?rlkey=ul425kpgjkczsnzgdygwb3ws2&st=8yvquj8q&raw=1",
    "logo": "https://www.dropbox.com/scl/fi/3wkqkruhh1xtezod2ef1v/knust_logo.png?rlkey=p24gylxo8nwj7ggqsi65syza2&st=y4beumn0&raw=1",
    "strength": [
      "Decentralized Collegiate System: Promotes efficient administrative and academic operations, reducing duplication and streamlining processes.",
      "Strategic Location: Situated on a scenic and expansive campus in Kumasi, providing a conducive environment for learning.",
      "Modern Facilities: Equipped with state-of-the-art buildings, verdant lawns, and tropical flora that enhance the campus experience.",
      "Diverse Residential Options: Offers a variety of well-organized halls and hostels catering to undergraduate and postgraduate students.",
      "Academic Excellence: High standards maintained through external examiners for degree examinations.",
      "Technological Education Leader: Renowned as a hub for training scientists and technologists, impacting Ghana and other African countries."
    ],
    "weakness": [
      "Population Pressure: Increasing student numbers may strain existing resources and facilities.",
      "Transition Challenges: Adjustments to the decentralized system may require ongoing efforts to harmonize operations effectively.",
      "Resource Allocation: The vast campus and numerous facilities demand significant maintenance and administrative oversight.",
      "Limited Housing: Growing student population could outpace available residential facilities, leading to overcrowding.",
      "Dependence on External Moderation: Reliance on external examiners could create logistical and time challenges in maintaining academic standards."
    ],
    "g_video": "https://www.youtube.com/watch?v=QixAdne1y3Y"
  },
  {
    "id": "30",
    "name": "University of Cape Coast",
    "location": "Cape Coast",
    "country": "Ghana",
    "region": "Central Region",
    "town": "Cape Coast",
    "type": "public",
    "note": "The University of Cape Coast, established in October 1962 as a University College affiliated with the University of Ghana, became an independent university on October 1, 1971, through an Act of Parliament. It gained full authority to confer its own degrees, diplomas, and certificates under the University of Cape Coast Act, 1971 (Act 390), later replaced by the University of Cape Coast Law, 1992 (PNDC Law 278). A draft Bill seeks to amend the 1992 law to expand the University's mandate, enabling it to train personnel in broader disciplines and align with Ghana's Constitution. The proposed changes aim to modernize operations, address societal demands, and adapt to advancements in higher education.",
    "nick": "UCC",
    "est_year": "1962",
    "rank": "47th",
    "application": "https://apply.ucc.edu.gh",
    "rate": "4.3",
    "reviews": "1,569 Google",
    "placement": "4.1",
    "hostel": "4.3",
    "facilities": "4.5",
    "sports": "4.1",
    "amenities": "4.4",
    "campus_number": "2",
    "campuses": [
      "The University of Cape Coast (UCC) in Ghana has two campuses: the Southern Campus (Old Site) and the Northern Campus (New Site):",
      "Southern Campus (Old Site): The original campus.",
      "Northern Campus (New Site): Also known as the Science Campus, this campus was established to accommodate the growing number of students. It's located near the communities of Kwaprow and Amamoma, about 1 kilometer from the Old Site. The New Site has modern structures, shopping centers, and good roads",
      "It is however worth noting that UCC has learning centers almost in the 16 regions of Ghana"
    ],
    "image": "https://www.dropbox.com/scl/fi/kui11txvk5g2l245mgomf/images-9.jpeg?rlkey=upugpdy34ew9uuzzllu8lj3ie&st=0klhl2x7&raw=1",
    "logo": "https://www.dropbox.com/scl/fi/izpp999446mbsf5pgg06n/ucc.png?rlkey=h6sm2bnxxze44hlods12i4b1r&st=c2j37q2d&raw=1",
    "strength": [
      "Comprehensive Academic Mandate: The University of Cape Coast has a diverse range of programs and disciplines, reflecting its evolving mandate to train personnel in various fields.",
      "Independence and Authority: The institution’s ability to confer its own degrees, diplomas, and certificates highlights its autonomy and academic credibility.",
      "Legal Framework for Modernization: The ongoing legislative amendments demonstrate a commitment to adapt to new challenges, societal demands, and developments in higher education.",
      "Strategic Vision: Plans to widen its focus and align with national and global educational needs showcase foresight and ambition."
    ],
    "weakness": [
      "Reliance on Legislative Changes: The need for a revised legal framework to formalize current practices and expand its scope indicates potential delays in addressing emerging educational demands.",
      "Adaptability Challenges: Balancing traditional academic practices with modern demands may strain resources and require significant structural adjustments.",
      "Evolving Focus: Broadening its mandate could dilute the institution's original focus and create challenges in maintaining quality across new disciplines.",
      "Legislative Dependency: Dependence on external legislative actions to drive key changes may limit the University's agility in responding to immediate challenges."
    ],
    "g_video": "https://www.youtube.com/watch?v=nt76rj4ZsDg"
  },
  {
    "id": "31",
    "name": "CK Tedam University for Technology and Applied Sciences",
    "location": "Navrongo",
    "country": "Ghana",
    "region": "Upper East Region",
    "town": "Navrongo",
    "type": "public",
    "note": "The C. K. Tedam University of Technology and Applied Sciences (CKT-UTAS), established by Act 1000 (2019) and operational since May 2021, focuses on integrating theory and practical development in technology and applied sciences. Named after statesman Clement Kubindewor Tedam, the university evolved from being a campus of the University for Development Studies (UDS), housing various faculties. It offers diploma, undergraduate, and postgraduate programs and is guided by experienced leadership, including its founding Governing Council. Despite its promising start, CKT-UTAS faces challenges as a new institution, including resource constraints and limited alumni support, while striving to establish its reputation.",
    "nick": "CKT-UTAS",
    "est_year": "2019",
    "rank": "Unknown",
    "application": "https://admissions.cktutas.edu.gh/myadmission/",
    "rate": "4.1",
    "reviews": "157 Google",
    "placement": "4.3",
    "hostel": "3.9",
    "facilities": "3.8",
    "sports": "4.0",
    "amenities": "3.7",
    "campus_number": "1",
    "campuses": [
      "CK Tedam University for Technology and Applied Sciences has one campus located in Navrongo, Upper East Region, Ghana. This is where the main administration and academic activities take place."
    ],
    "image": "https://www.dropbox.com/scl/fi/pa2wmurfsbrlho41921jc/2022-07-23-1.jpg?rlkey=yk4h4vwpi0o2oky00z3wjfgao&st=p4sr3l89&raw=1",
    "logo": "https://www.dropbox.com/scl/fi/ln2jfptjx3ukdztpunwi6/images.png?rlkey=hp1ica8rzn078ayo0evmc1obw&st=h2nwd2r9&raw=1",
    "strength": [
      "Specialized Focus: The University's mandate to integrate theory and practical development in technology and applied sciences aligns with contemporary industry needs.",
      "Rich Heritage: Named after a notable statesman, CKT-UTAS carries cultural and historical significance.",
      "Experienced Leadership: The presence of a founding Governing Council and management team with experienced professionals provides strong institutional leadership.",
      "Autonomous Status: Transitioning from a UDS campus to an independent university demonstrates growth and capability.",
      "Program Diversity: Offers a range of diploma, undergraduate, and postgraduate programs, catering to varied academic interests."
    ],
    "weakness": [
      "New Institution: As a newly established university, it may face challenges in building its reputation and infrastructure.",
      "Resource Constraints: Establishing new faculties and programs may stretch resources in the short term.",
      "Limited Alumni Network: Lacks a strong alumni base due to its recent establishment as an autonomous entity.",
      "Pandemic Challenges: Launching amid the COVID-19 pandemic may have disrupted initial operations and growth."
    ],
    "g_video": "https://www.youtube.com/watch?v=08NW3e4PQns"
  },
  {
    "id": "32",
    "name": "University Of Education",
    "location": "Winneba",
    "country": "Ghana",
    "region": "Central Region",
    "town": "Winneba",
    "type": "public",
    "note": "University of Education, Winneba (UEW), established in 1992 under PNDC Law 322, became a full university through Act 672 in 2004. Initially, it unified seven diploma-awarding colleges across various towns, including Winneba, Ajumako, Akwapim-Mampong, Kumasi, and Asante-Mampong. However, with the Akenten Appiah-Menka University Act (2020), the Kumasi and Asante-Mampong campuses are no longer part of UEW.",
    "nick": "UEW",
    "est_year": "1992",
    "rank": "111th",
    "application": "https://www.uew.edu.gh/admissions/apply",
    "rate": "4.5",
    "reviews": "50 Google",
    "placement": "4.0",
    "hostel": "4.2",
    "facilities": "4.0",
    "sports": "4.0",
    "amenities": "4.0",
    "campus_number": "2",
    "campuses": [
      "The University of Education, Winneba (UEW) has two campuses: and some College For Distance and E-Learning",
      "Winneba: The main campus, which is spread across three sites: North, Central, and South. The university's central administration is located in the North Campus.",
      "Ajumako: Located in the Central Region of Ghana, this campus is home to the Departments of AkanNzema Education, Ewe Education, Gur-Gonja Education, and Ga-Dangme Education. Ajumako is also known as the birthplace of Ottobah Cuguano, an 18th century abolitionist.",
      "CODeL centers are located in various regions across Ghana, including Accra, Kumasi, Tamale, and Ho and more. All the regions of Ghana"
    ],
    "image": "https://www.dropbox.com/scl/fi/c3g3q398p5wld3nk62scz/EbyDz0WWkAAV_TW.jpg?rlkey=k8wjsdey1vfwvvegit2wqo7lr&e=1&st=cbivvdqq&raw=1",
    "logo": "https://www.dropbox.com/scl/fi/u46zetbymrxbtnkvni6tr/uew.png?rlkey=j3hnldowxw3xzsz7cd047sfs9&st=cls14130&raw=1",
    "strength": [
      "Strong Foundation: Established from a network of diploma-awarding colleges, providing a robust academic base.",
      "Specialized Education Focus: Offers programs in teacher training, special education, languages, and technical skills.",
      "National Presence: Campuses in various regions initially contributed to widespread accessibility and influence.",
      "Legal Backing: Transition to a full university under Act 672 ensures institutional stability and credibility."
    ],
    "weakness": [
      "Decentralization Impact: Loss of Kumasi and Asante-Mampong campuses may reduce reach and resources.",
      "Legacy Challenges: Managing a network of colleges under one institution might present operational and administrative complexities.",
      "Niche Focus: Emphasis on education-related fields may limit diversification into other disciplines.",
      "Competition: Faces growing competition from other universities in Ghana, especially those offering broader programs."
    ],
    "g_video": "https://www.youtube.com/watch?v=HuODLpKwB-g"
  },
  {
    "id": "33",
    "name": "Simon Diedong Dombo University for Business and Integrated Development Studies",
    "location": "Bamahu",
    "country": "Ghana",
    "region": "Upper West Region",
    "town": "Wa",
    "type": "public",
    "note": "The Simon Diedong Dombo University of Business and Integrated Development Studies (SDD-UBIDS) was established in 2019 by Act 1001 and became operational in May 2020, with its main campus in Bamahu, Wa. Originating from the University for Development Studies (UDS) Wa campus, SDD-UBIDS focuses on applied research and practical education in business and integrated development studies. Its roots trace back to 1994, when the Faculty of Integrated Development Studies (FIDS) was established under UDS, transitioning through multiple locations before settling in Wa.",
    "nick": "SDD-UBIDS",
    "est_year": "2020",
    "rank": "Unknown",
    "application": "https://umis.ubids.edu.gh/admissionportal",
    "rate": "3.9",
    "reviews": "89 Google",
    "placement": "4.2",
    "hostel": "3.9",
    "facilities": "3.7",
    "sports": "3.9",
    "amenities": "3.6",
    "campus_number": "2",
    "campuses": [
      "The Simon Diedong Dombo University of Business and Integrated Development Studies (SDD-UBIDS) has two campuses: the main campus in Bamahu and an old campus:",
      "SDD-UBIDS is located in the municipality of Wa, in the Upper West region of Ghana. The university was established in 2019 and officially opened in May 2020. It was formerly the Wa campus of the University for Development Studies (UDS)"
    ],
    "image": "https://www.dropbox.com/scl/fi/qqexo9twulovoqs0t0sno/Screenshot_20250108_205114_Maps.jpg?rlkey=4j6lk2a95tctppsd0eqntuiqd&e=1&st=pmq0ufmo&raw=1",
    "logo": "https://www.dropbox.com/scl/fi/8oqivmiv2iypli3r9d0kv/1000092073-removebg-preview.png?rlkey=1des81ftd0wlzqwuc2q5ls2jp&st=o2g07sk0&raw=1",
    "strength": [
      "Focused Mandate: Specializes in business and integrated development studies, addressing critical regional and national development needs.",
      "Strong Legacy: Emerged from the well-established University for Development Studies (UDS), ensuring credibility and continuity.",
      "Applied Research Emphasis: Practical-oriented programs enhance real-world problem-solving skills and employability.",
      "Strategic Location: Main campus in Bamahu, Wa, serves as a hub for development-oriented education in the region.",
      "Dedicated Faculty History: Builds on the legacy and experience of the Faculty of Integrated Development Studies (FIDS)."
    ],
    "weakness": [
      "New Institution Challenges: Recent establishment may limit infrastructure, resources, and global recognition.",
      "Limited Diversification: Focus on specific fields may restrict broader academic offerings.",
      "Resource Dependency: Relocation history highlights reliance on borrowed facilities, which could indicate resource constraints.",
      "Competitive Pressure: Faces competition from other universities with similar mandates in Ghana."
    ],
    "g_video": "https://www.youtube.com/watch?v=sd3VMq3m6Ks"
  },
  {
    "id": "34",
    "name": "Akenten Appiah Menka University of Skills Training and Entrepreneurial Development",
    "location": "Kumasi",
    "country": "Ghana",
    "region": "Ashanti Region",
    "town": "Kumasi",
    "type": "public",
    "note": "The Akenten Appiah-Menka University of Skills Training and Entrepreneurial Development (AAMUSTED), established in 2020 under Act 1026, evolved from the COLTEK (Kumasi) and CAGRIC (Asante-Mampong) campuses of the University of Education, Winneba. Specializing in technical, vocational, and entrepreneurial training, AAMUSTED focuses on teacher education and fostering industry linkages for holistic learning. With nine faculties and 23 academic departments across its Kumasi and Asante-Mampong campuses, the university also houses a Centre for Competency-Based Training and Research (CCBTR), a Counselling Centre, and a Directorate for Teacher Professional Development. AAMUSTED is dedicated to equipping students with skills in TVET, entrepreneurship, and industry-relevant training, emphasizing job creation, critical thinking, and leadership development.",
    "nick": "AAMUSTED",
    "est_year": "2020",
    "rank": "Unknown",
    "application": "https://application.aamusted.edu.gh/applicant/login",
    "rate": "4.2",
    "reviews": "430 Google",
    "placement": "4.2",
    "hostel": "3.9",
    "facilities": "3.7",
    "sports": "3.9",
    "amenities": "3.6",
    "campus_number": "2",
    "campuses": [
      "Akenten Appiah Menka University of Skills Training and Entrepreneurial Development has two campuses: the Kumasi campus and the Asante-Mampong campus.",
      "The Kumasi campus is located in the Ashanti Region, in the town of Kumasi. This campus has Has five faculties and twelve academic department",
      "The Asante-Mampong campus is located in the Ashanti Region, the seat of the Silver Stool of the Asante Kingdom about 63 kilometers from the main campus. Its also has four faculties and eleven academic departments"
    ],
    "image": "https://www.dropbox.com/scl/fi/00w02garhz5xhduavvbjv/AAM_USTED.jpg?rlkey=32eztmgg9ov8cw499exovddlf&st=523ms1i8&raw=1",
    "logo": "https://www.dropbox.com/scl/fi/ma6m9d79jywbotuwbvz4d/AAM_USTEDLogo.png?rlkey=j2zbq3l6ivuslvnpiorw5hbnc&st=em4eiupi&raw=1",
    "strength": [
      "Specialized Focus: AAMUSTED is dedicated to technical, vocational, and entrepreneurial training, filling a critical niche in workforce development.",
      "Comprehensive Mandate: Provides teacher training in TVET and entrepreneurship, addressing national educational and economic needs.",
      "Competency-Based Training: The Centre for Competency-Based Training and Research (CCBTR) ensures practical and skill-oriented learning.",
      "Strong Industry Linkages: Emphasis on collaboration with industry and community enhances student employability and relevance to the job market.",
      "Established Infrastructure: Nine faculties and 23 academic departments across two campuses provide diverse academic opportunities.",
      "Strategic Location: The main campus in Kumasi and the Asante-Mampong campus are well-placed for accessibility and regional impact."
    ],
    "weakness": [
      "Limited Global Recognition: As a relatively new institution, it may face challenges in gaining international visibility.",
      "Resource Constraints: Expansion to meet growing demands in TVET and entrepreneurship might strain resources.",
      "Focus on Specific Fields: Limited diversification of academic programs may restrict broader appeal to prospective students.",
      "Dual-Campus Management: Managing two campuses could lead to administrative inefficiencies and logistical challenges.",
      "Dependence on Local Industry: Heavy reliance on industry linkages may face limitations if industry partnerships are not adequately maintained."
    ],
    "g_video": "https://www.youtube.com/watch?v=gNv3kPSFTkA"
  },
  {
    "id": "35",
    "name": "University for Development Studies",
    "location": "Tamale",
    "country": "Ghana",
    "region": "Northern Region",
    "town": "Tamale",
    "type": "public",
    "note": "The University for Development Studies (UDS), Ghana's first public university in the North, was established in 1992 to provide accessible higher education, promote research, and address societal challenges, particularly in rural areas. Operating a multi-campus system across Tamale, Nyankpala, Yendi, and other locations, UDS offers undergraduate and graduate programs through its schools, faculties, and research centers. With a pro-poor focus, it integrates academic learning with community-based initiatives like the Third Trimester Field Practical Programme (TTFPP) and Community-Based Education and Service (COBES) to reduce poverty and drive sustainable development. UDS emphasizes practical, field-based training and outreach to foster economic and community growth.",
    "nick": "UDS",
    "est_year": "1992",
    "rank": "123rd",
    "application": "https://admissions.uds.edu.gh/",
    "rate": "4.0",
    "reviews": "613 Google",
    "placement": "4.2",
    "hostel": "4.0",
    "facilities": "3.9",
    "sports": "4.1",
    "amenities": "4.0",
    "campus_number": "4",
    "campuses": [
      "The University for Development Studies has 4 main campuses all in the Northern Region. These are;",
      "Tamale Campus : The main campus of UDS located in the Tamale city.",
      "Nyankpala Campus : This is located in Nyankpala",
      "Tamale North Campus : This is located in Gbanyamni",
      "Eastern Campus : This is located in Yendi"
    ],
    "image": "https://www.dropbox.com/scl/fi/vf2vm7pjctypy11srj1d4/20210914_182029.jpg?rlkey=pkscv0vxdra50ghv3gnkq4h5q&e=1&st=i1ty5j0z&raw=1",
    "logo": "https://www.dropbox.com/scl/fi/1qavvk0rz0zpyr3n4lzik/UDSLogo.png?rlkey=4kxxzetarg3d2p6t8df72rna6&st=xbht17qj&raw=1",
    "strength": [
      "Pro-Poor Focus: Aims to address poverty and structural challenges, particularly in rural areas.",
      "Community Engagement: Unique programs like TTFPP and COBES integrate academic work with practical community service.",
      "Multi-Campus System: Expands accessibility across Northern Ghana and beyond.",
      "Practical Training: Emphasis on field-based, hands-on learning ensures students are well-prepared for real-world challenges.",
      "Diverse Offerings: Provides a wide range of programs across faculties, schools, and research centers.",
      "Sustainability Focus: Actively promotes sustainable development and socio-economic growth."
    ],
    "weakness": [
      "Geographical Limitation: Primarily focused on Northern Ghana, which might limit its appeal nationally and internationally.",
      "Resource Constraints: Operating multiple campuses could stretch resources, impacting infrastructure and quality.",
      "Newer Institution: Relatively young compared to other universities, which may limit its reputation and alumni influence.",
      "Complex Administration: Managing a multi-campus system may pose coordination and logistical challenges.",
      "Focus on Rural Areas: While commendable, the pro-poor emphasis might restrict its appeal to students and stakeholders seeking broader academic opportunities."
    ],
    "g_video": "https://www.youtube.com/watch?v=LLom0akiZkk"
  },
  {
    "id": "36",
    "name": "University of Professional Studies",
    "location": "Madina",
    "country": "Ghana",
    "region": "Greater Accra",
    "town": "Accra",
    "type": "public",
    "note": "The University of Professional Studies, Accra (UPSA), established in 1965, is Ghana's oldest institution for professional Accountancy and Management education, combining academic and professional training. Initially a private tutorial college, it became a government institution in 1978 and achieved university status in 2008, with its name officially changed in 2012. Accredited by the ACBSP, UPSA is uniquely mandated to offer both academic degrees and tuition for professional business qualifications. With over 23,000 students, it provides diverse programs in scholarship, professionalism, and entrepreneurship, producing graduates who hold key leadership positions in Ghana and abroad.",
    "nick": "UPSA",
    "est_year": "1965",
    "rank": "225th",
    "application": "https://upsasip.com/adm-area",
    "rate": "4.5",
    "reviews": "2,683 Google",
    "placement": "4.2",
    "hostel": "4.0",
    "facilities": "3.9",
    "sports": "4.1",
    "amenities": "4.0",
    "campus_number": "1",
    "campuses": [
      "University of Professional Studies has one campus located in Madina, Greater Accra Region, Ghana. This is where the main administration and academic activities take place."
    ],
    "image": "https://www.dropbox.com/scl/fi/jwyyr9j3iz6gp6e57se0p/2023-05-07.jpg?rlkey=d8l55v72ax3i04uuc0q9d7fz1&st=u02amncy&raw=1",
    "logo": "https://www.dropbox.com/scl/fi/czuzkmklr3ne9b30599y3/download-7.jpeg?rlkey=qzkdxfd3lwkqhurjfs6sbv6am&st=mah3engm&raw=1",
    "strength": [
      "Unique Dual Mandate: The only public institution in Ghana offering both academic degrees and professional qualifications.",
      "Rich History: Over 55 years of experience in professional Accountancy and Management education.",
      "Accreditation: Fully accredited by the Accreditation Council for Business Schools and Programmes (ACBSP), ensuring international standards.",
      "Reputation: Renowned for producing graduates who occupy key leadership roles in Ghana and beyond.",
      "Diverse Programs: Offers a wide range of professional, postgraduate, bachelor’s, and diploma programs.",
      "Significant Growth: Expanded from five students at inception to over 23,000 students currently enrolled."
    ],
    "weakness": [
      "Niche Focus: Strong emphasis on business and professional disciplines may limit appeal to students seeking broader academic fields.",
      "Competition: Faces stiff competition from other universities offering similar programs.",
      "Resource Demands: Increasing enrollment may strain infrastructure and resources.",
      "Perception Challenge: May be perceived primarily as a professional institution, which could overshadow its academic credentials.",
      "Limited Research Output: Focus on professional education may result in relatively lower emphasis on research and innovation."
    ],
    "g_video": "https://www.youtube.com/watch?v=o6BOsiBbZTY"
  },
  {
    "id": "37",
    "name": "University of Mines and Technology",
    "location": "Tarkwa",
    "country": "Ghana",
    "region": "Western Region",
    "town": "Accra",
    "type": "public",
    "note": "The University of Mines and Technology (UMaT) in Tarkwa, Ghana, began as Tarkwa Technical Institute in 1952 and was restructured multiple times to meet the country’s mining and technical manpower needs. Initially focused on mining technician training, it became the Tarkwa School of Mines in 1961 and later affiliated with Kwame Nkrumah University of Science and Technology (KNUST) to offer higher education programs. Over the years, recommendations for its upgrade led to its conversion into a standalone university in 2004 through the University of Mines and Technology, Tarkwa Act (Act 677).",
    "nick": "UMAT",
    "est_year": "1952",
    "rank": "222nd",
    "application": "https://portal.umat.edu.gh/apply/account/login",
    "rate": "4.4",
    "reviews": "568 Google",
    "placement": "4.2",
    "hostel": "4.0",
    "facilities": "3.9",
    "sports": "4.1",
    "amenities": "4.0",
    "campus_number": "2",
    "campuses": [
      "The University of Mines and Technology (UMaT) in Ghana has two campuses: the main campus in Tarkwa and a satellite campus in Essikado.",
      "Main campus : Located in Tarkwa, Western Region of Ghana Set on about 1.39 square kilometers of land about 2 kilometers south of Tarkwa town",
      "Satellite campus : Located in Essikado, Sekondi-Takoradi Metropolis. Home to the School of Railway and Infrastructure Development (SRID) Campus. The SRID Campus was established in partnership with Ghana's Ministry of Railways Development"
    ],
    "image": "https://www.dropbox.com/scl/fi/3a6ljwy7d2qr80bqeicer/images.jpeg?rlkey=9bute28qpmrc3zv0d3cgfvrgg&st=uiaepsss&raw=1",
    "logo": "https://www.dropbox.com/scl/fi/l9c04hkudg0j84cvn6ygu/1000095423-removebg-preview.png?rlkey=g1irk433uobarg5l5u0ryd7sk&st=d6gnizdr&raw=1",
    "strength": [
      "Strategic Location: Situated in Tarkwa, the center of Ghana’s mining activities, providing practical exposure and relevance.",
      "Focused Expertise: Specializes in mining and allied disciplines, making it a leader in this niche field.",
      "Historical Legacy: Over 70 years of evolving and adapting to industry needs.",
      "Affiliation with KNUST: Benefited from its prior affiliation with KNUST to establish a strong academic foundation.",
      "National Recognition: Established as a full university through a parliamentary act, affirming its importance to Ghana’s education and mining sectors."
    ],
    "weakness": [
      "Narrow Academic Scope: Heavy focus on mining and related fields may limit its appeal to a broader student demographic.",
      "Infrastructure Limitations: Continuous evolution may pose challenges in updating facilities to meet modern standards.",
      "Dependence on Industry Trends: Reliance on the mining sector for relevance and growth could be risky if the industry declines.",
      "Limited Diversification: Lack of diverse academic programs may hinder its ability to attract students interested in other fields.",
      "Regional Constraints: Location in a mining-centered town might limit accessibility and attractiveness to students from non-mining regions."
    ],
    "g_video": "https://www.youtube.com/watch?v=JzI_Ur1iZ-M"
  },
  {
    "id": "38",
    "name": "University of Health and Allied Sciences",
    "location": "Ho",
    "country": "Ghana",
    "region": "Volta Region",
    "town": "Ho",
    "type": "public",
    "note": "The University of Health and Allied Sciences (UHAS), established by Act 828 in December 2011, is Ghana’s first state university wholly dedicated to training healthcare professionals. Located in Ho and Hohoe in the Volta Region, it began in 2012 with 154 students. UHAS offers 22 undergraduate and various postgraduate programs across eight schools, including Medicine, Nursing, Pharmacy, and Public Health, along with two institutes for research and traditional medicine. Renowned for its focus on research, community service, and fostering lifelong learning, UHAS aims to produce globally competent graduates equipped to adapt to change and contribute to society within a supportive, values-driven environment.",
    "nick": "UHAS",
    "est_year": "2011",
    "rank": "204th",
    "application": "https://www.uhas.edu.gh/uhas/how-apply",
    "rate": "4.2",
    "reviews": "294 Google",
    "placement": "4.2",
    "hostel": "4.0",
    "facilities": "3.9",
    "sports": "4.1",
    "amenities": "4.0",
    "campus_number": "2",
    "campuses": [
      "The University of Health and Allied Sciences (UHAS) has two campuses: Ho and Hohoe. The Ho campus is the main campus and houses the central administration. The Hohoe campus is home to the School of Public Health.",
      "Ho Campus: The main campus is located in Ho, the capital of the Volta Region. It is the primary site for academic programs, research, and administrative functions. The campus features modern facilities, including lecture halls, laboratories, and student accommodation.",
      "Hohoe Campus: The Hohoe campus is situated in Hohoe, a town in the Volta Region. It is dedicated to the School of Public Health and offers specialized programs in public health and related disciplines. The campus provides a conducive environment for research and training in public health practices."
    ],
    "image": "https://www.dropbox.com/scl/fi/yebijc5iisiwbdwvq8740/download-5.jpeg?rlkey=0ltj34nbe9glh1m96j1pr9tkq&st=bbqlx5cp&raw=1",
    "logo": "https://www.dropbox.com/scl/fi/puwrrua4mizsarqxu6ru3/1000095442-removebg-preview.png?rlkey=x8gzqe53gjl0b7inzu7rewa1n&st=hu5cwg4m&raw=1",
    "strength": [
      "Specialized Focus: UHAS is the only public university in Ghana dedicated exclusively to healthcare training, ensuring a concentrated effort in producing highly skilled healthcare professionals.",
      "Diverse Programs: Offers 22 undergraduate and multiple postgraduate programs across eight specialized schools, ensuring comprehensive healthcare education.",
      "Research Orientation: Strong emphasis on research and community service, with institutes focused on health research and traditional medicine.",
      "Strategic Location: Located in the Volta Region, addressing regional healthcare education needs and contributing to local development.",
      "Global Vision: Prepares students to be global citizens, fostering adaptability, personal worth, and social responsibility.",
      "High Standards: Promotes traditional values and high behavioral standards, creating a disciplined and motivated learning environment."
    ],
    "weakness": [
      "Limited History: As a relatively young institution (established in 2012), it may lack the legacy and established reputation of older universities.",
      "Geographic Limitation: Concentrated in the Volta Region, which may limit accessibility for students from other parts of Ghana and beyond.",
      "Developing Infrastructure: Ongoing projects like the School of Dentistry and a third institute indicate that some facilities and programs are still in developmental stages.",
      "Dependence on Funding: Expansion and research ambitions may rely heavily on government or external funding, posing potential challenges in resource availability."
    ],
    "g_video": "https://www.youtube.com/watch?v=JYbAjdjlV8k"
  },
  {
    "id": "39",
    "name": "University of Energy and Natural Resources",
    "location": "Sunyani",
    "country": "Ghana",
    "region": "Bono Region",
    "town": "Sunyani",
    "type": "public",
    "note": "The University of Energy and Natural Resources (UENR), established in 2011 by Act 830, is a public institution in Ghana focused on leadership and excellence in energy and natural resource management through interdisciplinary approaches that integrate economics, law, policy, science, and engineering. Initiated by the late President Prof. J.E.A. Mills, UENR operates across three campuses in Sunyani, Nsoatre, and Dormaa Ahenkro, with specialized schools in Engineering, Energy, Sciences, Geosciences, Agriculture and Technology, Natural Resources, Arts and Social Sciences, and Graduate Studies. The Sunyani campus serves as the administrative hub, while Nsoatre and Dormaa focus on Engineering and Agriculture, respectively. The university also features field training stations to provide practical learning experiences, aspiring to become a center of excellence for training scientists and technologists in Ghana and beyond.",
    "nick": "UENR",
    "est_year": "2011",
    "rank": "260th",
    "application": "https://admissions.uenr.edu.gh/applicant-login",
    "rate": "4.1",
    "reviews": "863 Google",
    "placement": "4.2",
    "hostel": "4.0",
    "facilities": "3.9",
    "sports": "4.1",
    "amenities": "4.0",
    "campus_number": "3",
    "campuses": [
      "The University of Energy and Natural Resources (UENR) in Ghana has three campuses: Sunyani, Nsoatre, and Dormaa Ahenkro.",
      "The Sunyani campus serves as the administrative hub and offers a wide range of academic programs.",
      "The Nsoatre campus focuses on engineering programs, while the Dormaa Ahenkro campus specializes in agriculture and forestry.",
      "Dormaa Ahenkro, school of Agriculture and Technology and Geosciences is located on this campus",
      "UENR also has four field training stations: Mim, Bronsankoro, Kyeraa, and Bui."
    ],
    "image": "https://www.dropbox.com/scl/fi/b9qdir5d06jmg9ljtbfft/images-1.jpeg?rlkey=dxc0d94c6rlswfjvutt23osee&st=taiyehhd&raw=1",
    "logo": "https://www.dropbox.com/scl/fi/4maf86yciuowvf5hno4ia/1000095462-removebg-preview.png?rlkey=scfpkmgmmmpm2j4xwqiwj6fb0&st=gruicchv&raw=1",
    "strength": [
      "Specialized Focus: UENR’s emphasis on energy and natural resources, coupled with interdisciplinary approaches, makes it a unique institution addressing critical global challenges.",
      "Diverse Academic Offerings: With specialized schools in areas such as engineering, natural resources, and energy, it provides a wide array of academic and professional training.",
      "Strategic Multi-Campus Setup: The Sunyani, Nsoatre, and Dormaa campuses are strategically located, catering to various academic and research needs with adequate land resources for expansion.",
      "Practical Training: The presence of field training stations ensures hands-on learning experiences for students in agriculture, forestry, and engineering.",
      "Vision for Excellence: Its aspiration to become a center of excellence for scientists and technologists aligns with global demands for expertise in energy and resource management."
    ],
    "weakness": [
      "Relatively Young Institution: As a newer university, it may face challenges establishing a global reputation compared to older, more established institutions.",
      "Resource Limitations: Expanding infrastructure and maintaining multiple campuses require substantial funding, which may strain resources.",
      "Limited Global Reach: Despite its potential, UENR may have limited international collaborations and exposure compared to global leaders in energy and resource education.",
      "Regional Accessibility: Its campuses are regionally concentrated, which might limit accessibility for students from other parts of Ghana or internationally.",
      "Dependence on Government Funding: Being a public institution, its financial stability is closely tied to government support, which can be unpredictable."
    ],
    "g_video": "https://www.youtube.com/watch?v=JYbAjdjlV8k"
  },
  {
    "id": "40",
    "name": "University of Environment and Sustainable Development",
    "location": "Somanya",
    "country": "Ghana",
    "region": " Eastern Region",
    "town": "Somanya",
    "type": "public",
    "note": "The University of Environment and Sustainable Development (UESD), located in Somanya in Ghana's Eastern Region, is a public institution established by the UESD Act, 2015 (Act 898) and inaugurated in August 2020. Known for its serene environment and state-of-the-art facilities, UESD aims to be a center of excellence in environmental knowledge and sustainable development. Under the leadership of its founding Vice-Chancellor, Prof. Eric Nyarko-Sampson, the university is committed to producing graduates equipped with the knowledge and skills to drive environmental change, guided by its core values of honesty, opportunity, perseverance, and enterprise, encapsulated in the acronym HOPE.",
    "nick": "UESD",
    "est_year": "2020",
    "rank": "Unknown",
    "application": "https://apps.uesd.edu.gh/admissions",
    "rate": "4.5",
    "reviews": "97 Google",
    "placement": "4.2",
    "hostel": "4.0",
    "facilities": "3.9",
    "sports": "4.1",
    "amenities": "4.0",
    "campus_number": "1",
    "campuses": [
      "Somanya Campus: The main campus of UESD is located in Somanya, in the Eastern Region of Ghana. It is a modern and well-equipped campus designed to provide a conducive environment for teaching, learning, and research in environmental and sustainable development studies."
    ],
    "image": "https://www.dropbox.com/scl/fi/aavkcs8qbj6k54b2ww7a7/images.jpeg?rlkey=vrtaya02ngxz9n5l6q8un3skp&st=qi5rwgec&raw=1",
    "logo": "https://www.dropbox.com/scl/fi/xe554oap9r4eshzgcbcjz/1000095504-removebg-preview.png?rlkey=46d5id96nde6mn3s7remsew4y&st=occ9cwmf&raw=1",
    "strength": [
      "Specialization: UESD’s focus on environment and sustainable development addresses critical global challenges, positioning it as a unique institution in Ghana.",
      "Modern Facilities: The university boasts state-of-the-art facilities with smart features, creating a conducive environment for learning and research.",
      "Visionary Leadership: The founding Vice-Chancellor and the institution’s mission reflect a strong commitment to producing graduates who are agents of change.",
      "Core Values: Its emphasis on core values (HOPE) fosters a positive and ethical academic culture.",
      "Strategic Location: Situated in a serene environment, UESD provides an ideal atmosphere for academic and research pursuits."
    ],
    "weakness": [
      "New Institution: Being a recently established university, UESD may face challenges with brand recognition and attracting top-tier faculty and students.",
      "Limited Program Diversity: Its niche focus might limit opportunities for students interested in broader fields of study.",
      "Resource Constraints: As a growing institution, it may face funding and infrastructural limitations in its early years.",
      "Accessibility: Its location, while serene, could pose accessibility challenges for students and faculty from distant regions.",
      "Scalability: Expanding programs and facilities to meet increasing demand may be a logistical and financial challenge."
    ],
    "g_video": "https://www.youtube.com/watch?v=lC2NxCqK6HA"
  },
  {
    "id": "41",
    "name": "Ghana Institute of Management and Public Administration",
    "location": "Green Hill",
    "country": "Ghana",
    "region": " Greater Accra",
    "town": "Accra",
    "type": "public",
    "note": "The Ghana Institute of Management and Public Administration (GIMPA), established in 1961 and re-designated in 1969, is Ghana's premier national management development institute. Guided by successive mandates, including the GIMPA Act, 2004 (Act 676), the Institute provides training and education in leadership, management, public administration, and technology, offering certificates, diplomas, and degrees up to the doctoral level. GIMPA serves public, private, and NGO sectors in Ghana and internationally, maintaining its status as a Center of Excellence for training and management development with financial and operational autonomy. It is accredited by the National Accreditation Board.",
    "nick": "GIMPA",
    "est_year": "1961",
    "rank": "181st",
    "application": "https://apply.gimpa.edu.gh/login",
    "rate": "4.4",
    "reviews": "624 Google",
    "placement": "4.2",
    "hostel": "4.0",
    "facilities": "3.9",
    "sports": "4.1",
    "amenities": "4.0",
    "campus_number": "4",
    "campuses": [
      "The Ghana Institute of Management and Public Administration (GIMPA) has four campuses: Accra, Tema, Kumasi, and Takoradi.",
      "Accra Campus: The main campus is located in Greenhill, Accra, and houses the majority of GIMPA's facilities, including lecture halls, libraries, and administrative offices.",
      "Tema Campus: The Tema Campus is situated in the industrial city of Tema and offers a range of programs and services to students in the Greater Accra Region.",
      "Kumasi Campus: The Kumasi Campus serves students in the Ashanti Region and provides a conducive learning environment with modern facilities and resources.",
      "Takoradi Campus: The Takoradi Campus caters to students in the Western Region and offers a variety of programs and services to support their academic and professional development."
    ],
    "image": "https://www.dropbox.com/scl/fi/30a7ndw8m3v2bvx3cc7ht/IMG_1025.jpg?rlkey=4k818najntvvfzaznti14xr23&st=i5v7jjoc&raw=1",
    "logo": "https://www.dropbox.com/scl/fi/2cagss1ucyrocrd0io7r8/1000095534-removebg-preview-1.png?rlkey=q0zqyhpz8ptf9z1twumg694pl&e=1&st=fcq6gv33&raw=1",
    "strength": [
      "Reputation and Legacy: GIMPA has over 50 years of experience in management training, making it a trusted and reputable institution in Ghana and internationally.",
      "Comprehensive Mandate: Its broad mandate allows it to offer training, education, and research in leadership, management, public administration, and technology.",
      "Accreditation: GIMPA is accredited by the National Accreditation Board, ensuring its programs meet high academic and professional standards.",
      "Diverse Program Offerings: The Institute offers a wide range of qualifications, from certificates to doctoral degrees, catering to various academic and professional needs.",
      "Operational Autonomy: Its financial and operational independence allows it to adapt quickly to market demands and innovate in its offerings.",
      "Focus on Excellence: GIMPA’s mission emphasizes enhancing the capability of middle and top-level executives, ensuring relevance in both the public and private sectors."
    ],
    "weakness": [
      "Specialization Limitation: While its focus on management and public administration is a strength, it may limit its appeal to those seeking broader academic disciplines.",
      "Resource Dependence: Despite autonomy, maintaining financial and operational independence requires significant resources, which could be challenging in tough economic climates.",
      "Limited Reach: As an institution primarily centered in Ghana, its international presence and influence might be less compared to global management schools.",
      "Potential Overemphasis on Public Sector: A heavy focus on public sector training could limit appeal or applicability to certain private-sector needs."
    ],
    "g_video": "https://www.youtube.com/watch?v=NrXhxU_63RQ"
  },
  {
    "id": "42",
    "name": "Ghana Communication Technology University",
    "location": "Tesano",
    "country": "Ghana",
    "region": " Greater Accra",
    "town": "Accra",
    "type": "public",
    "note": "Ghana Communication Technology University (GCTU), established in 2005 and accredited in 2006, gained full public university status in 2020. Renowned for its technology-oriented, industry-relevant programs, GCTU partners with international institutions like Coventry University (UK) and Ramaiah University (India) to enhance transnational education. The University offers Certificate, Diploma, Degree, and Postgraduate programs across three faculties: Engineering, Computing and Information Systems, and Business, along with a Graduate School. With over 10,000 students, seasoned lecturers, and modern facilities, GCTU prepares graduates for careers in telecommunications, business, and ICT. Campuses are located in Tesano, Abeka, Kumasi, and various learning centers nationwide.",    "nick": "GIMPA",
    "est_year": "2005",
    "rank": "181st",
    "application": "https://apply.gctu.edu.gh",
    "rate": "4.4",
    "reviews": "757 Google",
    "placement": "4.2",
    "hostel": "4.0",
    "facilities": "3.9",
    "sports": "4.1",
    "amenities": "4.0",
    "campus_number": "3+",
    "campuses": [
      "Ghana Communication Technology University has over three campuses in Ghana, including Tesano, Abeka, and Kumasi. It also has various learning centers nationwide to cater to students across the country.",
      "Tesano Campus: The main campus of GCTU is located in Tesano, Accra, and serves as the hub for academic activities, administrative functions, and student services. It houses lecture halls, laboratories, libraries, and recreational facilities to support students' learning and development.",
      "Abeka Campus: The Abeka Campus is another key location for GCTU, providing additional facilities and resources for students pursuing programs in engineering, computing, and business. It complements the main campus in Tesano and offers a conducive environment for academic pursuits.", 
      "Kumasi Campus: GCTU's Kumasi Campus extends the university's reach to the Ashanti Region, providing students in the area with access to quality education and training in technology, business, and related fields. It offers a range of programs and services to support student success.",
      "Learning Centers: In addition to its main campuses, GCTU has established learning centers across the country to make education more accessible to students in various regions. These centers provide local support, resources, and facilities for students enrolled in GCTU programs. These learning centers can be founf in places like Takoradi, Ho, Tamale and more." 
    ],
    "image": "https://www.dropbox.com/scl/fi/g41sv7eug9ltlh6145o91/download-1.jpeg?rlkey=5pr24zj30gfk5pj66dkwb4rcu&st=9g2sab1f&raw=1",
    "logo": "https://www.dropbox.com/scl/fi/xqu98xl99bvu0vq18ijcc/1000096819-removebg-preview.png?rlkey=tc4m9pjoukooydyvp3xg6odyr&st=2wyv324u&raw=1",
    "strength": [
      "Specialization in Technology: GCTU focuses on technology-oriented, industry-relevant programs, particularly in ICT and telecommunications, aligning with modern workforce demands.",
      "Strong International Partnerships: Collaborations with institutions like Coventry University (UK) and Ramaiah University (India) enhance the quality of education and global exposure for students.",
      "Comprehensive Academic Offerings: A wide range of programs from Certificates to Doctoral degrees across multiple faculties and a Graduate School.",
      "State-of-the-Art Facilities: Modern training equipment and conducive learning environments support effective teaching and hands-on learning.",
      "Nationwide Accessibility: Multiple campuses and learning centers provide flexibility and accessibility to students across Ghana.",
      "Focus on Employability: GCTU emphasizes preparing students for meaningful careers in ICT, business, and telecommunications, contributing to national economic growth."
    ],
    "weakness": [
      "Limited Program Diversity: Heavy emphasis on ICT and technology may limit opportunities for students interested in non-technical fields.",
      "Regional Competition: Competing with other technology-focused institutions within and outside Ghana for recognition and student enrollment.",
      "Resource Dependence: Reliance on partnerships for certain aspects of academic delivery may pose challenges if partnerships weaken or dissolve.",
      "Scaling Challenges: Ensuring consistent quality of education and facilities across all campuses and learning centers could be a logistical and operational challenge.",
      "Public Awareness: As a relatively young institution, GCTU may face challenges in establishing a strong brand identity and recognition compared to older universities."
    ],
    "g_video": "https://www.youtube.com/watch?v=5wMGJQUlXSY"
  },
  {
    "id": "43",
    "name": "Accra Technical University",
    "location": "Accra",
    "campuses": "1",
    "note": "Accra Technical University",
    "Page": "ATUPage",
    "nick": "ATU",
    "type": "public"
  },
  {
    "id": "44",
    "name": "Bolgatanga Technical University",
    "location": "Bolgatango",
    "campuses": "1",
    "note": "require('../../assets/knust.jpeg')",
    "Page": "BTUPage",
    "nick": "BTU",
    "type": "public"
  },
  {
    "id": "45",
    "name": "Cape Coast Technical University",
    "location": "Cape Coast",
    "campuses": "1",
    "note": "require('../../assets/knust.jpeg')",
    "Page": "CCTUPage",
    "nick": "CCTU",
    "type": "public"
  },
  {
    "id": "46",
    "name": "Kumasi Technical University",
    "town": "Kumasi",
    "campuses": "1",
    "note": "require('../../assets/knust.jpeg')",
    "Page": "KsTUPage",
    "nick": "KsTU",
    "type": "public"
  },
  {
    "id": "47",
    "name": "Koforidua Technical University",
    "location": "Koforidua",
    "campuses": "1",
    "note": "require('../../assets/knust.jpeg')",
    "Page": "KTUPage",
    "nick": "KTU",
    "type": "public"
  },
  {
    "id": "48",
    "name": "Tamale Technical University",
    "location": "Tamale",
    "campuses": "1",
    "note": "require('../../assets/knust.jpeg')",
    "Page": "TATUPage",
    "nick": "TATU",
    "type": "public"
  },
  {
    "id": "49",
    "name": "Ho Technical University",
    "location": "Ho",
    "campuses": "1",
    "note": "require('../../assets/knust.jpeg')",
    "Page": "HTUPage",
    "nick": "HTU",
    "type": "public"
  },
  {
    "id": "50",
    "name": "Takoradi Technical University",
    "location": "Takoradi",
    "campuses": "1",
    "note": "require('../../assets/knust.jpeg')",
    "Page": "TTUPage",
    "nick": "TTU",
    "type": "public"
  },
  {
    "id": "51",
    "name": "Sunyani Technical University",
    "location": "Sunyani",
    "campuses": "1",
    "note": "require('../../assets/knust.jpeg')",
    "Page": "STUPage",
    "nick": "STU",
    "type": "public"
  },
  {
    "id": "52",
    "name": "Wa Technical University",
    "location": "Wa",
    "campuses": "1",
    "note": "require('../../assets/knust.jpeg')",
    "Page": "WTUPage",
    "nick": "WTU",
    "type": "public"
  },
  {
    "id": "53",
    "name": "University of Media, Arts and Communication",
    "location": "Wa",
    "campuses": "1",
    "note": "require('../../assets/knust.jpeg')",
    "Page": "UniMACPage",
    "nick": "UniMAC",
    "type": "public"
  },
  {
    "id": "54",
    "name": "Valley View University",
    "location": "Oyibi",
    "campuses": "2",
    "note": "VVU",
    "nick": "VVU",
    "type": "private",
    "image": "https://www.dropbox.com/scl/fi/7s9uraeabvpteve776bfl/ValleyViewUni.jpg?rlkey=yrteo0lcf0l8o5o1td8302ntx&st=xkc6pa7n&raw=1",
    "logo": "https://www.dropbox.com/scl/fi/5bkoi5ypofr3kzfcbvapd/VVW_logo.png?rlkey=749uq8tj9n0p0u1gn1yshrlt0&st=1cqfifev&raw=1"
  },
  {
    "id": "55",
    "name": "Trinity Theological Seminary",
    "location": "Legon",
    "campuses": "1",
    "note": "TTS",
    "Page": "TTSPage",
    "nick": "TTS",
    "type": "private"
  },
  {
    "id": "56",
    "name": "Akrofi-Christaller Institute of Theology, Mission and Culture",
    "location": "Akropon",
    "campuses": "1",
    "note": "require('../../assets/knust.jpeg')",
    "Page": "ACI",
    "nick": "ACI",
    "type": "private"
  },
  {
    "id": "57",
    "name": "Central University",
    "location": "Accra",
    "campuses": "1",
    "note": "require('../../assets/knust.jpeg')",
    "Page": "CentralPage",
    "nick": "Central",
    "type": "private"
  },
  {
    "id": "58",
    "name": "Pentecost University",
    "location": "Sowutuom",
    "campuses": "1",
    "note": "require('../../assets/knust.jpeg')",
    "Page": "PentVarsPage",
    "nick": "Pent Vars",
    "type": "private"
  },
  {
    "id": "59",
    "name": "All Nations University",
    "location": "Koforidua",
    "campuses": "1",
    "note": "require('../../assets/knust.jpeg')",
    "Page": "ANUPage",
    "nick": "ANU",
    "type": "private"
  },
  {
    "id": "60",
    "name": "Ashesi University",
    "town": "Kumasi",
    "campuses": "2",
    "note": "require('../../assets/knust.jpeg')",
    "Page": "AsheisiPage",
    "nick": "Ashesi",
    "type": "private",
    "image": "https://www.dropbox.com/scl/fi/ercpyegbzaasw2zfvk0w8/Ashesi.jpg?rlkey=bhhyg3gtzezuly5jy824ok8sf&st=qnr9mx0z&raw=1",
    "logo": "https://www.dropbox.com/scl/fi/dwwg10qyolpuevulhc1z3/asheisi_logo.jpeg?rlkey=37jk0gj75kpj29rwkcy5qqhew&st=aug2k0g6&raw=1"
  },
  {
    "id": "61",
    "name": "Catholic University College of Ghana",
    "location": "Fiapre",
    "campuses": "2",
    "note": "require('../../assets/knust.jpeg')",
    "Page": "AsheisiPage",
    "nick": "Ashesi",
    "type": "private"
  },
  {
    "id": "62",
    "name": "Methodist University",
    "location": "Accra",
    "campuses": "2",
    "note": "require('../../assets/knust.jpeg')",
    "Page": "AsheisiPage",
    "nick": "Ashesi",
    "type": "private"
  },
  {
    "id": "63",
    "name": "Presbyterian University",
    "location": "Abetifi",
    "campuses": "2",
    "note": "require('../../assets/knust.jpeg')",
    "Page": "AsheisiPage",
    "nick": "Ashesi",
    "type": "private"
  },
  {
  "id": "64",
  "name": "Regional Maritime University",
  "location": "Accra",
  "campuses": "1",
  "ImageUrl": "require('../../assets/knust.jpeg')",
  "Page": "RegMarUniPage"
  },
  {
  "id": "65",
  "name": "Regent University College of Science and Technology",
  "location": "Accra",
  "campuses": "1",
  "ImageUrl": "require('../../assets/knust.jpeg')",
  "Page": "RegUniColOfScipage"
  },
  {
  "id": "66",
  "name": "Accra Institute of Technology",
  "location": "Accra",
  "campuses": "1",
  "ImageUrl": "require('../../assets/knust.jpeg')",
  "Page": "AccraInstOfTechPage"
  },
  {
  "id": "67",
    "name": "Data Link Institute of Business and Technology",
    "location": "Tema",
    "campuses": "1",
    "ImageUrl": "require('../../assets/knust.jpeg')",
    "Page": "DataLinkInstOfBusTechPage"
  },
  {
    "id": "68",
    "name": "Islamic University College, Ghana",
    "location": "Accra",
    "campuses": "1",
    "ImageUrl": "require('../../assets/knust.jpeg')",
    "Page": "IslaUniColpage"
  },
  {
  "id": "69",
  "name": "BlueCrest College",
  "location": "Accra",
  "campuses": "1",
  "ImageUrl": "require('../../assets/knust.jpeg')",
  "Page": "BlueCrestColPage"
  },
  {
  "id": "70",
    "name": "Kessben University College",
    "location": "Kuntenase",
    "campuses": "1",
    "ImageUrl": "require('../../assets/knust.jpeg')",
    "Page": "KessbenColPage"
  },
  {
  "id": "71",
  "name": "Christ Apostolic University College",
  "location": "Kumasi",
  "campuses": "1",
  "ImageUrl": "require('../../assets/knust.jpeg')",
  "Page": "ChritApoUniColpage"
  },
  {
  "id": "72",
    "name": "Jayee University College",
    "location": "Accra",
    "campuses": "1",
    "ImageUrl": "require('../../assets/knust.jpeg')",
    "Page": "JayeeUniColPage"
  },
  {
    "id": "73",
    "name": "Ghana Baptist University College",
    "location": "Abuakwa",
    "campuses": "1",
    "ImageUrl": "require('../../assets/knust.jpeg')",
    "Page": "GhBaptUniColPage"
  },
  {
    "id": "74",
      "name": "Marshalls University College",
      "location": "Accra",
      "campuses": "1",
      "ImageUrl": "require('../../assets/knust.jpeg')",
      "Page": "MarshallsUniColPage"
  },
  {
  "id": "75",
    "name": "Dr Hilla Limann Technical University",
    "location": "Accra",
    "campuses": "1",
    "ImageUrl": "require('../../assets/knust.jpeg')",
    "Page": "MountcrestUniColPage"
  },
  {
    "id": "76",
      "name": "Kings University College",
      "location": "Accra",
      "campuses": "1",
      "ImageUrl": "require('../../assets/knust.jpeg')",
      "Page": "KingsUniCol"
  },
  {
    "id": "77",
    "name": "university of agriculture and environmental studies",
    "location": "Accra",
    "campuses": "1",
    "ImageUrl": "require('../../assets/knust.jpeg')",
    "Page": "WisconsinUniCol"
  },
  {
  "id": "78",
    "name": "university college of management studies",
    "location": "Kumasi"
  }

]
